# Модуль 1 | Вступ до Python
# Тема: Naming variables
# Розглянуто:
# -----------------------------------------------

# Правильне іменування змінних
name = "John"
age = 25
is_student = True
print(name, age, is_student)    # Виведе: John 25 Truef

# Правильне використання констант
PI = 3.14159
MAX_VALUE = 100
DEFAULT_NAME = "John Doe"
print(PI, MAX_VALUE, DEFAULT_NAME)

# Правильне іменування змінних з використанням змінних з інших змінних
width = 10
height = 5
area = width * height
print(area)

# Неправильне іменування змінних
n = "John"  # непояснююче ім'я змінної
x = True    # непояснююче ім'я змінної
f = 10.5    # непояснююче ім'я змінної
print(n, x, f)

# Неправильне іменування змінної з використанням цифр та спецсимволів
#2variable = "Invalid"   # початок змінної з цифри
#$price = 100            # початок змінної зі спецсимволу

# Неправильне іменування змінних з використанням зарезервованих слів
#class = "Invalid"       # зарезервоване слово використовується як назва змінної
#if = True               # зарезервоване слово використовується як назва змінної