#Спеціальні символи

'''
Спеціальні символи в рядках у Python, відомі також як екрановані символи або escape-символи, 
використовуються для представлення певних керувальних послідовностей або для включення символів, 
які не можна ввести безпосередньо у рядок коду.

Ці символи починаються з оберненої скісної риски (backslash, \), 
після якої йде один або кілька символів, що визначають спеціальну послідовність. 
Це означає, що наступний за ним знак потрібно сприймати як спеціальний символ, а не буквально.

Ось основні керувальні символи які необхідно знати:

\n - перенос рядка
\f - перенос сторінки
\r - повернення каретки
\t - табуляція
\v - вертикальна табуляція
'''
#Наприклад, символ \n відповідає за перенос рядка (line break).

print("Hello\nWorld")
#Виведенням буде слово після символу \n з нового рядка:
#Hello
#World

#Інший приклад — горизонтальна табуляція \t (tab):

print("Hello\tWorld")
#При виведенні між словами буде символ табуляції::
#Hello	World

#Приклад для повернення каретки \r (carriage return).

print("Hello my little\rsister")

#Виведення відбувається наступним чином: коли ми зустрічаємо символ \r, 
# то повертаємося на початок рядка і продовжуємо виведення.
#Це перезаписує попереднє виведення:
'''sistermy little'''

#Керувальний символ \b — забій (backspace).

print("Hello \bworld")

#Виведення здійснюється на один символ вліво та виконує вивід залишку після керувального символу.
#Результат: HellWorld


#Також якщо нам треба виконати виведення зворотної скісної риски.
print("Hello\\World")

#Виведення: Hello\World


#Щоб екранувати одинарні та подвійні лапки та дозволити використовувати лапки всередині рядкових літералів.

print('It\'s a beautiful day')
print("He said, \"Hello\"")

#Виведення:
#It's a beautiful day
#He said, "Hello"

'''
Ці спеціальні символи часто використовуються для форматування тексту в рядках, 
керування виведенням у консолі або терміналі, а також при роботі з даними у форматі Unicode. 
Вибирайте ту форму запису, яка більше підходить під конкретну ситуацію, 
і керуйтеся зручністю для запису і читання коду, який містить рядкову змінну.
'''