#Інструкція (statement) — це пов'язаний набір слів і символів із синтаксису мови, 
# які об'єднуються, щоб виразити одну ідею, одну інструкцію для машини.
#У прикладі є три інструкції: x = 2, y = x + 10, z = x * y
x = 2 # statement 1
y = x + 10 # statement 2
z= x * y # statement 3
print("x:", x) # statement 4
print("y:", y) # statement 5
print("z:", z) # statement 6

#У Python вираз (expression) — це комбінація значень, змінних, операторів та викликів функцій, які інтерпретатор обчислює ("виконує") для отримання якогось результату. Вирази завжди щось повертають. Іншими словами, кожного разу,
#  коли Python обчислює вираз, він повертає або виводить яке-небудь значення.

a = 1 #expression 1: a = 1, присвоює значення 1 змінній a
b = 2 #expression 2: b = 2, присвоює значення 2 змінній b
c = a + b + 10 #expression 3: c = a + b + 10, обчислює суму значень змінних a, b та 10
print(c)  # виведе 13, оскільки a + b + 10 обчислюється як 1 + 2 + 10
result = (a * b) + (c / 2) #expression 4: обчислює добуток a та b, ділить c на 2, а потім додає ці два результати
print(result)  # виведе 8.5, оскільки (1 * 2) + (13 / 2) обчислюється як 2 + 6.5    