# Модуль 1 | Вступ до Python
# Тема: Examples operand operator
# Розглянуто:
# -----------------------------------------------

# Розглянемо знайомий всім приклад зі школи. Нехай у нас є прямокутний трикутник зі сторонами 10 і 5. Позначимо сторони наступними змінними
side_a = 10
side_b = 5
# Тепер ми можемо обчислити гіпотенузу за допомогою теореми Піфагора, яка стверджує, що квадрат гіпотенузи дорівнює сумі квадратів катетів.
hypotenuse = (side_a ** 2 + side_b ** 2) ** 0.5 # оператор: ** - це оператор піднесення до степеня, який використовується для обчислення квадратів сторін та квадратного кореня гіпотенузи:
print(hypotenuse)  # виведе 11.180339887498949

# розрахувати площу трикутника, то вираз у коді повинен бути наступним:
area = (side_a * side_b) / 2 # оператор: * - це оператор множення, який використовується для обчислення площі трикутника за формулою (1/2) * base * height
print(area)  # виведе 25.0

#Щоб отримати тільки цілу частину, треба використовувати операцію ділення без остачі //
n = 5000

hours = n //(60 * 60)
minutes = (n - hours * 60 * 60) // 60
seconds = n - hours * 60 * 60 - minutes * 60
print(f"{hours} hours, {minutes} minutes, {seconds} seconds")  # виведе 1 hours, 23 minutes, 20 seconds

#Ще один оператор, який ми розглянемо — це залишок від ділення у Python. Він обчислюється за допомогою оператора %, відомого як оператор взяття залишку.
#Цей оператор ділить одне число на інше і повертає залишок від цього ділення.
x = 10
y = 3
remainder = x % y  # оператор: % - це оператор взяття залишку, який використовується для обчислення залишку від ділення 10 на 3
print(remainder)  # виведе 1, оскільки 10 ділиться на 3 з залишком 1 (3 * 3 = 9, а 10 - 9 = 1)

z= 15
n = 4
remainder = z % n  # оператор: % - це оператор взяття залишку, який використовується для обчислення залишку від ділення 15 на 4
print(remainder)  # виведе 3, оскільки 15 ділиться на 4 з залишком 3 (4 * 3 = 12, а 15 - 12 = 3)

c = 7
d = 5
remainder = c % d  # оператор: % - це оператор взяття залишку, який використовується для обчислення залишку від ділення 7 на 5
print(remainder)  # виведе 2, оскільки 7 ділиться на 5 з залишком 2 (5 * 1 = 5, а 7 - 5 = 2)

#Цей оператор часто використовується для перевірки на кратність, 
# наприклад, визначаючи, є число парним чи непарним:
x % 2 == 0  # оператор: % - це оператор взяття залишку, який використовується для перевірки, чи є число x парним (залишок від ділення на 2 дорівнює 0)
x % 2 == 1  # оператор: % - це оператор взяття залишку, який використовується для перевірки, чи є число x непарним (залишок від ділення на 2 дорівнює 1)

#Порядок виконання операцій у виразі

ratio = 10
result = 8 * (ratio + 5) - ratio ** 2
print(result)  # виведе 20, оскільки спочатку виконується дужка (ratio + 5), 
#потім піднесення до степеня (ratio ** 2), потім множення (8 * (ratio + 5)), і нарешті віднімання (8 * (ratio + 5) - ratio ** 2)

-3 ** 2  # -9
print(-3 ** 2)  # виведе -9, оскільки оператор піднесення до степеня має вищий пріоритет,
#ніж унарний мінус. Спочатку обчислюється 3 ** 2, що дорівнює 9, а потім застосовується унарний мінус, що дає результат -9.

(-3) ** 2  # 9
print((-3) ** 2)  # виведе 9, оскільки дужки змінюють порядок виконання операцій.
#Спочатку обчислюється -3, а потім підноситься до степеня 2, що дає результат 9.

#Розглянемо приклад. 
# Складемо програму, яка обчислює відстані між точками з координатами (x1, y1) та (x2, y2) 
# формула відстані Евкліда для розрахунку наступна: d = sqrt((x2 - x1) ** 2 + (y2 - y1) ** 2)

x1 = 10
y1 = 10
x2 = 25
y2 = 25
d = ((x2 - x1)**2 + (y2 - y1)**2)**0.5
print(d)  # виведе 21.213203435596427,
#оскільки обчислення відстані між точками (10, 10) та (25, 25) за формулою Евкліда дає результат приблизно 21.213203435596427