# Модуль 1 | Вступ до Python
# Тема: Type casting in python
# Розглянуто:
# -----------------------------------------------

#Приведення типів
#Python — це мова з динамічною строгою типізацією. Це означає, що та сама змінна може змінювати свій тип у міру виконання нових інструкцій, але інтерпретатор автоматично не змінюватиме тип даних.
#Приведення типів у Python — це процес конвертації одного типу даних в інший.

age = input("How old are you?")
print(age)  # виведе вік, введений користувачем, але це буде рядок (str)
print(type(age))  # виведе <class 'str'>, оскільки введ користувачем дані зберігаються як рядок

#Функція input повертає тип str — рядок, і порівняти значення age з числом 18 не можна, бо не зрозуміло, як має відбуватися таке порівняння.
#Але можна перетворити тип змінної age в int за допомогою вбудованої функції int (функція називається так samo, як і тип):
age = input("How old are you? ")
age = int(age)
print(age)  # виведе вік, введений користувачем, але тепер це буде ціле число (int)
print(type(age))  # виведе <class 'int'>, оскільки тепер змінна age має тип int

#Для перетворення рядків у числа з крапкою можна використовувати функцію float:
pi = float('3.14')
print(pi)  # виведе 3.14, перетворивши рядок '3.14' у число з плаваючою точкою (float)
print(type(pi))  # виведе <class 'float'>, оскільки змінна pi має тип float

#Також можна перетворити практично будь-який Python-об'єкт у рядок функцією str:
pi_str = str(3.14)
age_str = str(29)
print(pi_str)  # виведе '3.14', перетворивши число 3.14 у рядок
print(age_str)  # виведе '29', перетворивши число 29 у рядок
print(type(pi_str))  # виведе <class 'str'>, оскільки змінна pi_str має тип str
print(type(age_str))  # виведе <class 'str'>, оскільки змінна age_str має тип str

#Приведення до булевого типу (True або False) виконується функцією bool. Це може бути використано для перевірки істинності або хибності значень.
#Зазвичай числове значення 0, порожні колекції ([], (), {}) та None перетворюються на False. Усе інше — на True.

bool(0)  # False
bool(1)  # True
bool(-1)  # True
bool("")  # False
bool("Hello")  # True
bool([])  # False
bool([1, 2, 3])  # True
bool(None)  # False

#Приклад. Дано сторону квадрата a, яка вводиться користувачем. Треба скласти програму знаходження його периметра.

a = float(input("Введіть сторону квадрата a: "))
P = 4 * a
print(f"Периметр квадрата дорівнює {P}")
print(type(P))  # виведе <class 'float'>, оскільки змінна P має тип float, який був отриманий в результаті множення числа з плаваючою точкою (float) на ціле число (int)

#Приклад. Для кава-брейків на конференції закуплено круасани, стаканчики та пакунки кави. Ціна круасана — $1.04, ціна стаканчика — $0.34, ціна пакунка кави — $4.42. Потрібно класти програму, яка обчислює, скільки повних доларів пішло на закупівлю їжі для кава-брейків і яка її повна вартість у центах.

# Встановлюємо ціни на продукти
price_per_croissant = 1.04
price_per_glass = 0.34
price_per_coffee_pack = 4.42

# Кількість кожного продукту
num_croissants = int(input("Введіть кількість круасанів: "))
num_glasses = int(input("Введіть кількість склянок: "))
num_coffee_packs = int(input("Введіть кількість упаковок кави: "))
    
# Обчислення загальної вартості
total_cost = num_croissants * price_per_croissant + \
             num_glasses * price_per_glass + \
             num_coffee_packs * price_per_coffee_pack

# Визначаємо кількість повних доларів і центів
total_dollars = int(total_cost)
total_cents = int(total_cost * 100)

# Вивід результату
print(f"Загальна вартість у повних доларах: {total_dollars} доларів")
print(f"Загальна вартість у центах: {total_cents} центів")
print(type(total_dollars))  # виведе <class 'int'>, оскільки total_dollars є цілим числом
print(type(total_cents))  # виведе <class 'int'>, оскільки total_cents є цілим числом, отриманим шляхом множення total_cost на 100 і перетворення результату в int

#Оператори / і // використовуються для виконання операцій ділення, але вони працюють по-різному.
#Оператор / ділення завжди повертає результат ділення як дійсне число float, навіть якщо обидва операнди є цілими числами.
#Наприклад, тут ми виконуємо дію над числами типу int, але результат завжди буде float:

result = 10 / 2
print(result)  # виведе 5.0, оскільки оператор / завжди повертає результат ділення як дійсне число (float), навіть якщо обидва операнди є цілими числами (int)  
result = 7 / 2
print(result)  # виведе 3.5, оскільки оператор / завжди повертає результат ділення як дійсне число (float), навіть якщо обидва операнди є цілими числами (int)  


#Оператор // цілочисельного ділення повертає результат ділення з відкиданням дробової частини. Фактично він виконує округлення вниз до найближчого цілого числа. А ось тип повернутого значення залежить від типу операндів.
result = 7 // 2
print(result)  # виведе 3, оскільки оператор // виконує цілочисельне ділення і повертає результат як ціле число (int), якщо обидва операнди є цілими числами (int)
result = 2.5// 1.2
print(result)  # виведе 2.0, оскільки оператор // виконує цілочисельне ділення і повертає результат як число з плаваючою точкою (float), якщо хоча б один з операндів є числом с плаваючою точкой (float)