#Типізація параметрів функції
'''
В Python, починаючи з версії 3.5, ви можете використовувати "type hints" (підказки типів) для вказівки очікуваних типів параметрів. 
Це дозволяє коду бути більш зрозумілим та може допомогти у виявленні можливих помилок.
'''

#функцію ми можемо записати тепер наступним чином:

def print_max(a: int, b: int):
    if a > b:
        print(a, 'максимально')
    elif a == b:
        print(a, 'дорівнює', b)
    else:
        print(b, 'максимально')

print_max(3, 4)  # пряма передача значень

x = 5
y = 7
print_max(x, y)  # передача змінних як аргументів

'''
У цьому прикладі параметри a: int та b: int позначають, що функція print_max очікує два аргументи типу int (цілі числа).
 Типізація параметрів допоможе нам зробити очікування функції щодо вхідних даних більш явними.

Типізація в Python є опціональною та не впливає на виконання коду в рантаймі (run-time), але вона може бути корисною для розробників. 
Це дозволяє легше розуміти код, забезпечує кращу підтримку від редакторів коду,
 а також полегшує виявлення помилок перед виконанням коду. 
 
'''