#Розпакування списків та словників

'''
Давайте розглянемо можливості операторів * та **. 
Їх використовують для розпаковки списків та словників. 
Розпакування списків та словників в Python — це потужна можливість, 
яка дозволяє присвоїти значення зі списку або словника до змінних одним рядком коду. 
Ця функція значно спрощує роботу з колекціями даних.
'''

#Розпакування списку дозволяє присвоїти елементи списку окремим змінним. Наприклад:
my_list = [1, 2, 3]
a, b, c = my_list
print(a)  # Виведе: 1
print(b)  # Виведе: 2
print(c)  # Виведе: 3
#Тут a отримає значення 1, b отримає 2, і c отримає 3.

#Якщо вам потрібно ігнорувати деякі з елементів списку під час розпакування, можна використовувати _:
my_list = [1, 2, 3]
a, _, c = my_list
print(a)  # Виведе: 1
print(c)  # Виведе: 3
#У цьому прикладі a отримає 1, другий елемент списку буде ігноровано, і c отримає 3.

#Можна також розпакувати частину списку, використовуючи *:
my_list = [1, 2, 3]
a, *rest = my_list
print(a)  # Виведе: 1
print(rest)  # Виведе: [2, 3]
#Тут a отримає перший елемент списку 1, 
# а rest стане списком, що містить всі інші елементи та дорівнюватиме [2, 3].

#Розпакування списків корисне, коли вам потрібно швидко присвоїти значення зі списку змінним 
# або коли вам потрібно ігнорувати деякі з цих значень.

#Розпакування словників працює трохи інакше 
# і зазвичай використовується під час передачі аргументів у функцію.

def greet(name, age):
    print(f"Hello {name}, you are {age} years old.")

person_info = {"name": "Alice", "age": 25}
greet(**person_info)
#Виведення:
# Hello Alice, you are 25 years old.

#У цьому прикладі **person_info розпаковує словник person_info, 
# і його ключі та значення передаються як ключові аргументи в функцію greet.

#Розпакування словників часто використовується для передачі іменованих аргументів у функції, 
# особливо коли кількість аргументів або їхні імена не відомі заздалегідь.

