# Модуль 1 | Вступ до Python
# Тема: Dictionary method pop
# Розглянуто:
# -----------------------------------------------

#Метод pop()
#методу pop(), який у словниках дозволяє видалити елемент за вказаним ключем і
#  повернути його значення. Наприклад, якщо ми маємо словник my_dict = {"name": "Alice", "age": 25} і виконуємо age = my_dict.pop("age"), 
# то змінна age отримає значення 25, а пара ключ-значення "age": 25 буде видалена зі словника. Якщо ключ не знайдено,
#  метод викидає помилку, але можна встановити значення за замовчуванням другим аргументом, 
# яке повертатиметься в такому випадку.

my_dict = {"name": "Alice", "age": 25}
print(my_dict)
my_dict.pop("age")
print(my_dict)
my_dict ["name"] = "Sem"
print(my_dict)
my_dict.pop("age")
print(my_dict)