# Модуль 1 | Вступ до Python
# Тема: Dictionaries
# Розглянуто:
# -----------------------------------------------

#Словник — це контейнер, який зберігає пари ключ-значення. 
# Ключем може бути будь-який незмінний тип даних Python (число, рядок, кортеж тощо).

#Словники використовуються для зберігання даних, які можна легко визначити та змінити за допомогою унікального ключа.

#Створення пустого словника:

my_dict = {}
print(my_dict)  # Виведе: {}
print(type(my_dict))

#Для створення заповненого деякими значеннями словника достатньо перелічити пари ключ-значення через кому всередині 
#фігурних дужок — ключ іде першим, потім двокрапка та значення.

my_dict = {"name": "Alice", "age": 25, "city": "New York"}
print(my_dict)  # Виведе: {'name': 'Alice', 'age': 25, 'city': 'New York'}

#Можна виконувати різні операції зі словниками, такі як доступ до елементів,
#  їх зміна, додавання, видалення, а також перевірка наявності ключів.

#Для доступу до значення у словнику за ключем використовуйте квадратні дужки із ключем. Наприклад, у нас є словник my_dict із ключем "name", і ми можемо отримати відповідне значення так:
my_dict = {"name": "Alice", "age": 25, "city": "New York"}
print(my_dict["name"])  # Виведе 'Alice'
print(my_dict["age"])   # Виведе 25
print(my_dict["city"])  # Виведе 'New York'
print([my_dict["age"], my_dict["name"]])  # Виведе [25, 'Alice']

#Щоб змінити значення або додати нову пару ключ-значення, просто використовуйте ключ для присвоєння нового значення:

my_dict = {"name": "Alice", "age": 25, "city": "New York"}
my_dict["age"] = 26  # Зміна існуючого значення
my_dict["country"] = "USA"  # Додавання нової пари ключ-значення
my_dict["name"] = "Bob"  # Зміна існуючого значення
my_dict["address"] = "Broadway"  # Додавання нової пари ключ-значення
print(my_dict)  # Виведе: {'name': 'Bob', 'age': 26, 'city': 'New York', 'country': 'USA', 'address': 'Broadway'}
my_dict["email"] = "alice@example.com"  # Додавання нової пари ключ-значення
print(my_dict)  # Виведе: {'name': 'Bob', 'age': 26, 'city': 'New York', 'country': 'USA', 'address': 'Broadway', 'email': '

#Видалити елемент за ключем можна за допомогою оператора del:
del my_dict["age"]  # Видаляє пару ключ-значення з ключем "age"
print(my_dict)  # Виведе: {'name': 'Bob', 'city': 'New York', 'country': 'USA', 'address': 'Broadway', 'email': 'alice@example.com'}

#Для перевірки, чи є ключ у словнику, використовуй оператор in:

print("name" in my_dict)  # Виведе: True
print("age" in my_dict)   # Виведе: False
print("school" in my_dict)  # Виведе: False