#Список — це впорядкований змінюваний контейнер даних. 
# Списки не диктують розробнику тип даних, який можна помістити в цей контейнер,
#  і можуть містити будь-які типи даних у будь-якому зручному порядку.
#  Це одна з найбільш універсальних і важливих структур даних.

#Існують два способи створити порожній список:

#1.за допомогою функції list
#2.за допомогою літерального позначення []

my_list = list()

empty_list = []
#Списки можуть містити будь-які типи даних, включаючи інші списки:
my_list = [1, 2, 3, 'four', 'five', [6, 7, 8]]
#Списки підтримують індексацію, що дозволяє отримувати доступ до окремих елементів за їх позицією:
print(my_list[0])  # Виведе: 1
print(my_list[3])  # Виведе: 'four'
#Списки також підтримують негативну індексацію, яка дозволяє отримувати доступ до елементів з кінця списку:
print(my_list[-1])  # Виведе: [6, 7, 8]
print(my_list[-2])  # Виведе: 'five'

#список із п'ятьох чисел.
my_list2 = [1, 2, 3, 4, 5]
print(my_list2)  # Виведе: [1, 2, 3, 4, 5]
print(my_list2[0])  # Виведе: 1
print(my_list2[2:5])  # Виведе: [3, 4, 5]
print(type(my_list2))  # Виведе: <class 'list'>
print(len(my_list2))  # Виведе: 5

#Списки можуть містити різні типи даних:
my_list3 = [1, "Hello", 3.14]
print(my_list3)  # Виведе: [1, 'Hello', 3.14]
print(type(my_list3))  # Виведе: <class 'list'>

#Якщо ви хочете додати щось до свого списку, використовуйте метод append()
my_list3.append("New Item")
print(my_list3)  # Виведе: [1, 'Hello', 3.14, 'New Item']
print(my_list3[3])  # Виведе: 'New Item'

my_list3.remove(3.14)
my_list3.remove(1)
print(my_list3)  # Виведе: ['Hello', 'New Item']

#Під впорядкованістю варто розуміти властивість контейнера зберігати порядок елементів при роботі з ним.
#  Видаляючи елемент, додаючи новий, роблячи вставку/видалення з кінця/початку/середини контейнера, 
# ти гарантуєш, що всі елементи, окрім тих, яких безпосередньо стосувалася операція, зберігають порядок.

#Найкориснішою властивістю впорядкованості є можливість доступу до елементів контейнера за індексом цього елемента в контейнері.

some_iterable = ["a", "b", "c"]
first_letter = some_iterable[0]
middle_one = some_iterable[1]
last_letter = some_iterable[2]
print(first_letter)  # Виведе: 'a'
print(some_iterable)  # Виведе: ['a', 'b', 'c']

#Python підтримує індексування елементів з кінця. 
# Для цього потрібно додати - і вказати номер елемента з кінця. 
# Оскільки у Python -0 == 0, то перший елемент з кінця — це -1, другий — -2 і так далі. 
# Наш приклад можна переписати, використовуючи індексування з кінця, ось так:

some_iterable2 = ["a", "b", "c", "d"]
first_letter = some_iterable2[-4]
middle_one = some_iterable2[-3]
last_letter = some_iterable2[-2]
second_last_letter = some_iterable2[-1]

print(second_last_letter)  # Виведе: 'b'

#Найкориснішою властивістю змінності списків є можливість змінити значення будь-якого елемента списку:
my_list4 = [1, 2, 3, 4, 5]
print(my_list4)  # Виведе: [1, 2, 3, 4, 5]
my_list4[1] = -2
my_list4[-1] = 50
print(my_list4)  # Виведе: [1, -2, 3, 4, 50]

