#Список — це впорядкований змінюваний контейнер даних. 
# Списки не диктують розробнику тип даних, який можна помістити в цей контейнер,
#  і можуть містити будь-які типи даних у будь-якому зручному порядку.
#  Це одна з найбільш універсальних і важливих структур даних.

#Існують два способи створити порожній список:

#1.за допомогою функції list
#2.за допомогою літерального позначення []

my_list = list()

empty_list = []
#Списки можуть містити будь-які типи даних, включаючи інші списки:
my_list = [1, 2, 3, 'four', 'five', [6, 7, 8]]
#Списки підтримують індексацію, що дозволяє отримувати доступ до окремих елементів за їх позицією:
print(my_list[0])  # Виведе: 1
print(my_list[3])  # Виведе: 'four'
#Списки також підтримують негативну індексацію, яка дозволяє отримувати доступ до елементів з кінця списку:
print(my_list[-1])  # Виведе: [6, 7, 8]
print(my_list[-2])  # Виведе: 'five'

#список із п'ятьох чисел.
my_list2 = [1, 2, 3, 4, 5]
print(my_list2)  # Виведе: [1, 2, 3, 4, 5]
print(my_list2[0])  # Виведе: 1
print(my_list2[2:5])  # Виведе: [3, 4, 5]
print(type(my_list2))  # Виведе: <class 'list'>
print(len(my_list2))  # Виведе: 5

#Списки можуть містити різні типи даних:
my_list3 = [1, "Hello", 3.14]
print(my_list3)  # Виведе: [1, 'Hello', 3.14]
print(type(my_list3))  # Виведе: <class 'list'>

#Якщо ви хочете додати щось до свого списку, використовуйте метод append()
my_list3.append("New Item")
print(my_list3)  # Виведе: [1, 'Hello', 3.14, 'New Item']
print(my_list3[3])  # Виведе: 'New Item'

my_list3.remove(3.14)
my_list3.remove(1)
print(my_list3)  # Виведе: ['Hello', 'New Item']

#Під впорядкованістю варто розуміти властивість контейнера зберігати порядок елементів при роботі з ним.
#  Видаляючи елемент, додаючи новий, роблячи вставку/видалення з кінця/початку/середини контейнера, 
# ти гарантуєш, що всі елементи, окрім тих, яких безпосередньо стосувалася операція, зберігають порядок.

#Найкориснішою властивістю впорядкованості є можливість доступу до елементів контейнера за індексом цього елемента в контейнері.

some_iterable = ["a", "b", "c"]
first_letter = some_iterable[0]
middle_one = some_iterable[1]
last_letter = some_iterable[2]
print(first_letter)  # Виведе: 'a'
print(some_iterable)  # Виведе: ['a', 'b', 'c']

#Python підтримує індексування елементів з кінця. 
# Для цього потрібно додати - і вказати номер елемента з кінця. 
# Оскільки у Python -0 == 0, то перший елемент з кінця — це -1, другий — -2 і так далі. 
# Наш приклад можна переписати, використовуючи індексування з кінця, ось так:

some_iterable2 = ["a", "b", "c", "d"]
first_letter = some_iterable2[-4]
middle_one = some_iterable2[-3]
last_letter = some_iterable2[-2]
second_last_letter = some_iterable2[-1]

print(second_last_letter)  # Виведе: 'b'

#Найкориснішою властивістю змінності списків є можливість змінити значення будь-якого елемента списку:
my_list4 = [1, 2, 3, 4, 5]
print(my_list4)  # Виведе: [1, 2, 3, 4, 5]
my_list4[1] = -2
my_list4[-1] = 50
print(my_list4)  # Виведе: [1, -2, 3, 4, 50]

#Щоб повернути елемент за індексом i та видалити його зі списку,
#  ми використовуємо метод pop(i). За замовчуванням i = -1, і метод повертає останній елемент списку.

#Нехай у нас є наступний список із букв:

chars = ['a', 'b', 'c']
print(chars)  # Виведе: ['a', 'b', 'c']
last = chars.pop(1)  # Видаляє 'b' і повертає його
print(last)  # Виведе: 'b'
print(chars)  # Виведе: ['a', 'c']

#Якщо виникає потреба розширити один список іншим,
#  то використовують метод extend. Наприклад, ми маємо два списки chars та numbers і хочемо,
#  щоб у список chars додалися всі елементи списку numbers.


chars = ['a', 'b', 'c']
numbers = [1, 2]
chars.extend(numbers)
print(chars)  # Виведе: ['a', 'b', 'c', 1, 2]

numbers.extend(chars)
print(numbers)  # Виведе: [1, 2, 'a', 'b', 'c']

#Для вставки елемента x на позицію з індексом i у список ми використовуємо метод insert(i, x). 
# Розглянемо приклад, сформуємо список chars

chars = ["a", "c"]
chars.insert(1, "b")  # Вставляє 'b' на позицию с индексом 1
print(chars)  # Виведе: ['a', 'b', 'c']
chars.insert(0, "start")  # Вставляє 'start' на позицию с индексом 0
print(chars)  # Виведе: ['start', 'a', 'b', 'c']
chars.insert(4, "end")  # Вставляє 'end' на позицию с индексом 4
print(chars)  # Виведе: ['start', 'a', 'b', 'c', 'end']

#Для очищення списку від елементів треба використати метод clear().
#  Після цього список буде пустим, без жодного елемента.

chars = ['a', 'b']
chars.clear() # []
print(chars)  # Виведе: []

#Метод index() у списках Python використовується для знаходження індексу першого входження заданого елемента у списку. 
# Якщо елемент не знаходиться у списку, Python викине помилку ValueError. 
# Обробляти такі помилки ми навчимося далі по курсу.

chars = ['a', 'b', 'c', 'd']
c_ind = chars.index('c')
print(c_ind)  # Виведе: 2

#Метод count() у списках Python використовується для підрахунку кількості разів, скільки певний елемент зустрічається у списку. Цей метод корисний, 
# коли вам потрібно дізнатися, чи часто і як часто певний елемент присутній у списку. У
#  наступному прикладі ми підрахуємо, скільки чисел 2 зустрічається у списку my_list.

my_list = [1, 2, 3, 4, 2, 2, 5, 2]
count_2 = my_list.count(2)
print(count_2)  # Виведе 4, оскільки число 2 зустрічається 4 рази

#Будь-яка колекція дозволяє дізнатися кількість елементів 
# у ній за допомогою вбудованої функції len

my_list = [1, 2, 3, 4, 5]
print(len(my_list)) # Виведе: 5, оскільки у списку 5 елементів

#Метод sort() у списках Python використовується для сортування елементів списку в порядку зростання або спадання. 
# Цей метод модифікує вихідний список, тобто сортування відбувається "на місці", і він не створює новий відсортований список.

#За замовчуванням sort() впорядковує елементи списку за зростанням, від меншого до більшого.

nums = [3, 1, 4, 1, 5, 9, 2]
nums.sort()
print(nums)  # Виведе [1, 1, 2, 3, 4, 5, 9]

#Якщо потрібно відсортувати елементи в порядку спадання, використовуй аргумент reverse=True.

nums.sort(reverse=True)
print(nums)  # Виведе [9, 5, 4, 3, 2, 1, 1]

#Метод sort() також дозволяє сортувати за ключем, який визначає, як порівнювати елементи.
#Наприклад, у наступному прикладі ми відсортуємо список за довжиною слова у списку.

words = ["banana", "apple", "cherry", "kiwi"]
words.sort(key=len)
print(words)  # Виведе ['kiwi', 'apple', 'banana', 'cherry']
words.sort(key=len, reverse=True)
print(words)  # Виведе ['banana', 'cherry', 'apple', 'kiwi']

#Вбудований метод sorted() у Python використовується для сортування колекцій. 
# Він відрізняється від методу sort(), який застосовується безпосередньо до списку, 
# та змінює його: sorted() повертає новий відсортований об'єкт, залишаючи вихідний об'єкт без змін.
#  Метод також використовує аргумент reverse=True, щоб відсортувати об'єкти у зворотному порядку, 
# та за допомогою аргументу key можна вказати функцію, яка буде застосовуватися для визначення порядку сортування.

#Сортування списку:
nums = [3, 1, 4, 1, 5, 9, 2]
sorted_nums = sorted(nums)
print(sorted_nums)  # Виведе [1, 1, 2, 3, 4, 5, 9]

#Сортування у зворотному порядку:
sorted_nums_desc = sorted(nums, reverse=True)
print(sorted_nums_desc)  # Виведе [9, 5, 4, 3, 2, 1, 1] 

#Сортування за довжиною:
words = ["banana", "apple", "cherry", "kiwi"]
sorted_words = sorted(words, key=len)
print(sorted_words)  # Виведе ['kiwi', 'apple', 'banana', 'cherry']

#Сортування за довжиною у зворотному порядку:
sorted_words_desc = sorted(words, key=len, reverse=True)
print(sorted_words_desc)  # Виведе ['banana', 'cherry', 'apple', 'kiwi']

#Щоб повернути копію списку, ми використовуємо метод copy().

chars =  ['a', 'b']
chars_copy = chars.copy()
print(chars_copy)  # Виведе: ['a', 'b']

#останній метод списків, який ми розглянемо — це метод reverse(). Він використовується, щоб змінити порядок елементів у списку на зворотний.
chars = ["banana", "apple", "cherry"]
chars.reverse()
print(chars)  # Виведе: ['cherry', 'apple', 'banana']