# Модуль 1 | Вступ до Python
# Тема: Math operations on sets symmetric difference
# Розглянуто:
# -----------------------------------------------

#Симетрична різниця між двома множинами включає всі елементи, які містяться в одній множині, але не містяться в іншій, і навпаки. Щоб знайти всі елементи з двох множин, окрім загальних, нам необхідно використати оператор ^.
# Альтернативно, можна використовувати метод symmetric_difference:

a = {1, 2, 3}
b = {3, 4, 5}
print(a.symmetric_difference(b))  # {1, 2, 4, 5}
print(a ^ b)  # {1, 2, 4, 5}

d = {1, 2, 3, 6, 5}
e = {2, 3, 4, 5}
print(d ^ e)  # {1, 4, 6}
print(d.symmetric_difference(e))  # {1, 4, 6}