# Модуль 1 | Вступ до Python
# Тема: Math operations on sets union
# Розглянуто:
# -----------------------------------------------

#Об'єднання двох множин включає всі елементи з обох множин, але без дублікатів. 
# Це знаходиться за допомогою оператора | або методу union:

a = {1, 2, 3}
b = {3, 4, 5}
print (a.union(b)) # {1, 2, 3, 4, 5}
print (a | b) # {1, 2, 3, 4, 5}
print (b | a) # {1, 2, 3, 4, 5}

d = {1, 2, 3, 6, 5}
e = {2, 3, 4, 5}
print (d | e) # {1, 2, 3, 4, 5, 6}
print (d.union(e)) # {1, 2, 3, 4, 5, 6}