# Модуль 1 | Вступ до Python
# Тема: Plural
# Розглянуто:
# -----------------------------------------------

#Множини — це неврегульований контейнер, який містить тільки унікальні елементи. У множину можна додавати тільки незмінні типи даних.

#Щоб створити порожню множину, потрібно викликати функцію set()

empty_set = set()
print(empty_set)

#Для створення заповненої множини достатньо передати будь-який об'єкт, що ітерується, у функцію set:
a = set("Hello")
print(a)

items = ["box-1", "box-2", "box-1", "box-3"]
unique_items = set(items)
print(unique_items) # Залишаться тільки унікальні: {'box-1', 'box-2', 'box-3'}

#Або ж скористатися синтаксисом з фігурними дужками (як у словниках), 
# але елементи у фігурних дужках просто перелічити через кому без двокрапок:

b = set({1, 2, 3, 4, 5})
print(b)

#Унікальність множини передбачає, що якщо множина вже містить такий елемент, то спроба додати ще один такий самий нічого не змінить.

numbers = {1, 2, 3, 1, 2, 3}
set(numbers)
print(numbers)

#Приклад. Нехай у нас є список, з якого треба видалити дублікати

lst = [1, 2, 3, 1, 2, 2, 3, 4, 1]
d_lst = set(lst)
print(d_lst)
lst = list(d_lst)
print(lst)

