# Модуль 1 | Вступ до Python
# Тема: String methods
# Розглянуто:
# -----------------------------------------------

#Рядок — це незмінна впорядкована послідовність символів у деякому кодуванні.
#  За замовчуванням використовується кодування UTF-8, але можна працювати майже з усіма відомими таблицями кодування символів.

#У Python рядок теж можна розглядати як колекцію символів. 
# Це означає, що рядки підтримують багато операцій, які зазвичай застосовуються до колекцій, таких як списки.

#Важливо тільки пам'ятати, що рядки в Python є незмінними (immutable), 
# це значить, що ви не можете змінити окремі символи в рядку без створення нового рядка.

#Різні варіанти використання лапок обумовлені тим, що при використанні одинарних лапок можна в рядку вказати подвійні та навпаки.
game_string = 'My favorite "Game"'
print(game_string)

game_string2 = "My favorite 'Game'"
print(game_string2)

game_string3 = "My favorite \"Game\"" # use with \ \ for double quotes
print(game_string3)

#Впорядкована послідовність означає, що до елементів рядка можна звертатися за індексом:
s = "Hello world!"
print(s[0])# H
print(s[-1])# !
print(s[2:5])# llo
print(s[-5:-2])# wor

#Незмінна послідовність означає, що якщо рядок уже створений, то змінити його не можна, можна тільки створити новий.
s = "Hello world!"
#s[0] = "Q"# Тут буде викликано виняток (помилка) TypeError

#Для того, щоб усі літери рядка перевести у верхній регістр, використовується метод upper:
s = "Hello" 
print(s.upper()) # Виведе 'HELLO'

#Для переведення в нижній регістр використовується метод lower():
s= "Some Text"
print(s.lower()) # Виведе 'some text'

#Щоб перевірити, що рядок починається з підрядка, є метод startswith:

s = "Bill Jons"
print(s.startswith("Bi"))  # Виведе True

print(s.startswith("bi"))  # Виведе False

#Щоб перевірити, що рядок закінчується на підрядок, є метод endswith:

s = "hello.jpg"
print(s.endswith("jpg"))  # Виведе True

#Цей метод зручно використовувати для перевірки розширення файлів.
#Метод capitalize робить перший символ рядка великою літерою, а інші — малими:
s = "hello world".capitalize()  # Результат: "Hello world"
print(s)

#Метод title перетворює перші літери кожного слова в рядку на великі:
s = "hello world".title()  # Результат: "Hello World"
print(s)

#методи isdigit, isalpha, isspace, які перевіряють, чи складається рядок тільки з цифр, літер, пробілів тощо відповідно:

"123".isdigit()  # True
print("123".isdigit())
"3.14".isdigit()  # False
print("3.14".isdigit())

"hello".isalpha()  # True
print("hello".isalpha())
" ".isspace()  # True
print(" ".isspace())

