#Форматування рядків

#До появи f- рядків у Python активно використовували метод format.
#Метод format у Python використовується для форматування рядків. Він замінює {} в рядку на аргументи, які передаються методу format. Це надзвичайно корисно для створення динамічних рядків.

#Розглянемо декілька прикладів використання методу format:

# Просте форматування рядка
name = 'John'
print('Hello, {}!'.format(name))

# Форматування з декількома аргументами
age = 25
print('Hello, {}. You are {} years old.'.format(name, age))

# Використання іменованих аргументів
print('Hello, {name}. You are {age} years old.'.format(name='Jane', age=30))

# Використання індексів для вказівки порядку аргументів
print('Hello, {1}. You are {0} years old.'.format(age, name))

