# Модуль 1 | Вступ до Python
# Тема: Tuples
# Розглянуто:
# -----------------------------------------------

#Кортежі
#Кортежі в Python — це важлива структура даних, подібна до списків, але з ключовою відмінністю: вони незмінні.
#  Це означає, що після створення кортежу, не можна змінити його елементи, не можна додавати/видаляти/переставляти елементи. 
# При спробі змінити кортеж, ви отримаєте повідомлення про помилку.

#Розглянемо основні аспекти кортежів. 
# Щоб створити порожній кортеж, існують два способи, хоча й не зовсім зрозуміло, навіщо потрібний порожній кортеж

my_tuple = tuple() # або
print(my_tuple)
print(type(my_tuple))
# або
my_tuple = ()
print(my_tuple)
print(type(my_tuple))

#Створення ж непорожніх кортежів відбувається наступним чином:
my_tuple = (1, 2, 3)
print(my_tuple)
print(type(my_tuple))

#Якщо ви хочете створити кортеж з одним елементом, не забудьте поставити кому.
#  Це важливо, запам'ятай це! Інакше ви отримаєте змінну, 
# яка просто зберігає елемент кортежу.
my_tuple = ("Text",)
print(my_tuple)
print(type(my_tuple))

#Кортеж, як і список, може містити різні типи даних:
my_tuple_list = (1, "Hello", 3.14)
print(my_tuple_list)
print(type(my_tuple_list))  

#Кортеж можна створити без дужок, ця операція називається упакування кортежу:
my_tuple = 1, "Hello", 3.14
print(my_tuple)
print(type(my_tuple))   

#Із операції з кортежами ми маємо фактично тільки доступ до елементів.
#  Ми можемо отримати доступ до елементів кортежу за допомогою індексації.

my_tuple = 1, "Hello", 3.14, True
first_item = my_tuple[0]  # Отримати перший елемент
print(first_item)

second_item = my_tuple[1]  # Отримати другий елемент
print(second_item)

last_item = my_tuple[-1]  # Отримати останній елемент
print(last_item)  

#набір точок на площині (кортежі). Їх можна використовувати як ключі у словнику:
points = {
    (0, 0): "O",
    (1, 1): "A",
    (2, 2): "B"
}

print(points[(1, 1)])
print(type(points[(1, 1)]))

