#Створення та виклик функцій

#Функція оголошується за допомогою ключового слова def.
#  Після ключового слова вказується ім'я функції, за яким йде пара дужок (), у яких можна вказати імена деяких змінних, та двокрапка : в кінці рядка. Далі слідує блок команд, що складають функцію.
#  На прикладі можна бачити, що насправді це дуже просто:

def say_hello():
		# тіло функції
    print('Привіт, Світ!')

# Кінець функції say_hello()

# виклик функції
say_hello()

# ще один виклик функції
say_hello()

'''Ми визначили функцію з ім'ям say_hello, використовуючи описаний вище синтаксис. 
Ця функція не приймає параметрів, тому в дужках не оголошені якісь змінні.'''

#My example
def print_fruits():
    fruits = ["apple", "banana", "cherry"]
    for index, value in enumerate(fruits):
        print(index, value)

print_fruits()

print_fruits()