#Аргументи функції

'''
Параметри функції – це деякі вхідні дані, які ми можемо передати функції,
 щоб отримати результат, що відповідає цим даним.

 Функції можуть приймати параметри, тобто деякі значення, що передаються в середину функції для того, щоб вона щось зробила з ними. 
 Ці параметри схожі на змінні, за виключенням того, 
 що значення цих змінних вказуються при виклику функції та під час роботи функції їм вже присвоєні їх значення.

 Параметри вказуються в дужках при оголошенні функції та розділяються комами. 
 Аналогічно ми передаємо значення, коли викликаємо функцію.
 
 
'''

#Зверніть увагу на термінологію: імена, вказані при оголошенні функції, називаються параметрами, тоді як значення, 
# які ви передаєте у функцію при її виклику, – аргументами

def print_max(a, b):
    if a > b:
        print(a, 'максимально')
    elif a == b:
        print(a, 'дорівнює', b)
    else:
        print(b, 'максимально')

print_max(3, 4)  # пряма передача значень

x = 5
y = 7
print_max(x, y)  # передача змінних як аргументів

'''
Тут ми визначили функцію з ім'ям print_max, яка використовує два параметри з іменами a та b. 
Ми знаходимо найбільше число із застосуванням простого оператора if..else та виводимо це число. 
При першому виклику функції print_max ми напряму передаємо числа як аргументи.

print_max(3, 4)  # пряма передача значень

У другому випадку ми викликаємо функцію зі змінними як аргументи, 
print_max(x, y) призначає значення аргументу x параметру a, а значення аргументу y – параметру b.

x = 5
y = 7
print_max(x, y)  # передача змінних як аргументів

В обох випадках функція print_max працює однаково.
'''

#my example

def print_min(a, b):
    if a < b:
        print(a, 'мінімально')
    elif a == b:
        print(a, 'дорівнює', b)
    else:
        print(b, 'мінімально')
        
try:
    x = int(input("Enter a number: "))
    y = int(input("Enter another number: "))
    print_min(x, y)
except ValueError:
    print("Please enter valid numbers.")