#Принципи змінності об'єктів у Python

'''
У Python всі об'єкти передаються за посиланням, але важливо розуміти різницю між змінними (mutable)
 та незмінними (immutable) типами даних, адже від цього залежить, 
як відбувається передача об'єктів та які помилки можуть виникати.

Незмінні типи в Python — це ті, що не можуть бути змінені після їх створення. Це включає типи, 
як-от цілі числа int, дійсні числа float, рядки str, кортежі tuple.

Коли незмінний об'єкт передається у функцію, фактично передається його копія, 
і будь-які зміни цього об'єкту в функції не впливають на оригінальний об'єкт.
'''
#Розглянемо наступний приклад:
def modify_string(original: str) -> str:
    original = "змінено"
    return original

str_var = "оригінал"
print(modify_string(str_var))  # виведе: змінено
print(str_var)                # виведе: оригінал

#У цьому прикладі, навіть після зміни рядка в функції modify_string, оригінальна змінна str_var залишається незмінною.

'''
Змінні типи, як списки list, словники dict, множини set, можуть змінюватися. 
Коли змінний об'єкт передається у функцію, передається посилання на цей об'єкт, і зміни, 
зроблені всередині функції, відображаються на оригінальному об'єкті.'''

#Подивимось наступний приклад зі змінними типами:

def modify_list(lst: list) -> None:
    #lst.append(4)
    lst.append(input("Введіть данні для додавання до списку: "))

my_list = [1, 2, 3]
modify_list(my_list)
print(my_list)  # виведе: [1, 2, 3, дані, введені користувачем]

#Тут зміни всередині функції modify_list впливають на оригінальний список my_list. 
# Отже, ми передали в функцію modify_list наш список my_list і після виконання функції modify_list(my_list) сам список змінився.

#Змінні об'єкти, передані у функції, можуть змінитися несподівано. 
# Це може привести до помилок, особливо якщо ви не очікуєте, що об'єкт буде змінено.

'''
При "копіюванні" змінного об'єкта шляхом простого присвоєння new_list = old_list ви копіюєте посилання, а не сам об'єкт. 
Це означає, що зміни в одному списку відображатимуться й у іншому. 
Фактично в середині функції modify_list відбулося присвоювання lst = my_list
'''

'''Перед тим, як передавати змінні об'єкти, такі як списки або словники у функцію, важливо зважати на те, чи плануєте ви змінювати ці об'єкти в функції.
 Якщо вам потрібно залишити оригінальний об'єкт без змін, розгляньте можливість створення копії.
 Бо якщо ви передаєте змінний об'єкт (наприклад, список) у функцію та модифікуєте його всередині функції, оригінальний список теж зміниться.'''

#Використовуйте метод copy() для створення копій змінних об'єктів, якщо не хочете змінювати оригінал.

def modify_list(lst: list) -> None:
    lst = lst.copy()
    lst.append(4)

my_list = [1, 2, 3]
modify_list(my_list)
print(my_list)  # виведе: [1, 2, 3]

#Тут список my_list після виконання функції modify_list вже не зазнає змін.