# Модуль 2 | Керування потоком та функції
# Тема: Returning result
# Розглянуто:
# -----------------------------------------------

#Повернення результату

'''
Повернення результату з функції в Python виконується за допомогою оператора return. Цей оператор завершує виконання функції та "повертає" значення, яке може бути використане в інших частинах програми.
 Це особливо корисно для отримання результатів обчислень, обробки даних та інших операцій. 
В Python ви можете явно вказати тип даних, який повертається функцією, використовуючи анотації типів.
'''

#Базовий синтаксис для повернення значення з функції виглядає наступним чином:
'''
def my_function() -> ReturnType:
    # виконати дії
    return result

ReturnType вказує на тип даних, який функція має повертати. 
Це може бути будь-який тип даних, як-от int, float, str, list, dict, або навіть складніші типи, включаючи класи та інтерфейси, що ми побачимо згодом в курсі. 
Для повернення значення з функції необхідно вказати, що повернути після ключового слова return. 
Тому result - це значення або змінна, яку функція повертає.
'''
#Розглянемо приклад функції, яка сумує два числа та повертає результат:


def add_numbers(num1: int, num2: int) -> int:
    sum = num1 + num2
    return sum

result = add_numbers(5, 10)
print(result)  # Виведе: 15
#У цьому прикладі, функція add_numbers приймає два цілих числа num1 та num2 та повертає їх суму.
#  Тип значення який повертає функція вказаний як int.


#my example

def add_numbers(num1: int, num2: int) -> int:
    sum = num1 + num2
    return sum

try:
    result = add_numbers(int(input("Enter the first number: ")), int(input("Enter the second number: ")))
    print(result)  # Виведе суму двох чисел
except ValueError:
    print("Please enter valid numbers.")

#Приклад функції, що повертає рядок:
def greet(name: str) -> str:
    return f"Привіт, {name}!"

greeting = greet("Олексій")
print(greeting)  # Виведе: Привіт, Олексій!
#Тут функція greet приймає рядок name та повертає привітання, також у форматі рядка.

#Функція, що повертає булеве значення:

def is_even(num: int) -> bool:
    return num % 2 == 0

#check_even = is_even(4)  # Виведе: True
check_even = is_even(int(input("Enter a number: ")))  # Виведе: False або True в залежності від введеного числа
print(check_even)  # Виведе: True або False в залежності від введеного числа

#Функція is_even перевіряє, чи число парне, і повертає результат булеве значення True або False.

'''
Повернення значень з функцій є ключовим аспектом програмування, оскільки це дозволяє функціям не тільки виконувати певні дії, але й комунікувати результатами цих дій з іншими частинами програми.
'''