# Модуль 2 | Керування потоком та функції
# Тема: Task for function
# Розглянуто:
# -----------------------------------------------

#Задача на функцію

'''
Для закріплення отриманих знань, розглянемо наступний приклад. 
Уявімо, що перед нами стоїть задача: конвертувати кожен символ у рядку в його відповідний код ASCII. 
Це класична задача, що демонструє взаємодію з рядками в Python та їх обробку.

Спершу вирішимо, де будемо зберігати ці коди.
Один з найкращих варіантів - це використання словника dict, оскільки він дозволяє зберігати пари ключ-значення. 
У нашому випадку, ключем буде символ, а значенням - його код ASCII.
Для отримання числового коду символу ми будемо використовувати вбудовану функцію ord(). 
Ця функція приймає один символ і повертає його код ASCII.
Наприклад, ord('A') повертає 65, оскільки 65 - це код ASCII для символу 'A'.
Рядки в Python - це ітеруємі об'єкти, що означає, що ми можемо пройтися по кожному символу рядка, використовуючи цикл for. 
Це ідеально підходить для нашої задачі, адже нам потрібно обробити кожен символ окремо.
'''

#Для більшої гнучкості та можливості повторного використання коду ми обгорнемо нашу логіку в функцію. 
# Це дасть нам змогу легко використати цей функціонал із різними рядками ще не один раз.

def string_to_codes(string: str) -> dict:
    # Ініціалізація словника для зберігання кодів
    codes = {}  
    # Перебір кожного символу в рядку
    for ch in string:  
        # Перевірка, чи символ вже є в словнику
        if ch not in codes:
            # Додавання пари символ-код в словник  
            codes[ch] = ord(ch)  
    return codes

'''
Ми створюємо пустий словник codes, де будемо зберігати наші пари символ-код. 
Далі за допомогою циклу for ми ітеруємося по кожному символу ch у вхідному рядку string.
В середині циклу перевіряємо кожен символ рядка, чи вже присутній він у словнику? 
Якщо ні, використовуємо вбудовану функцію ord(ch) для отримання коду ASCII цього символу та додаємо цю пару до словника codes.
 Після завершення циклу повертаємо словник codes.'''

'''
Після виклику функції string_to_codes із рядком "Hello world!", отримуємо словник, 
де кожен унікальний символ рядка відображений на його числовий код ASCII.'''

#result = string_to_codes("Hello world!")
result = string_to_codes(input("Введіть рядок для конвертації в коди ASCII: "))
print(result)

#1 for result = string_to_codes("Hello world!") Виведе: {'H': 72, 'e': 101, 'l': 108, 'o': 111, ' ': 32, 'w': 119, 'r': 114, 'd': 100, '!': 33}
#2 for result = string_to_codes(input("Введіть рядок для конвертації в коди ASCII: ")) Виведе словник з символами та їх кодами ASCII, залежно від введеного рядка.

#Цей приклад показує, як можна об'єднати знання про рядки, словники, цикли та функції для розв'язання конкретних завдань в Python.