# Модуль 3 | Дата, час та рядки
# Тема: Regular expressions
# Розглянуто:
# -----------------------------------------------

#Regular expressions

'''
Регулярні вирази (regular expressions, часто скорочують як regex або regexp) - це потужний інструмент для роботи з текстом, який дозволяє шукати, замінювати або витягувати певні шаблони в тексті за допомогою спеціального синтаксису. Регулярні вирази широко використовуються в програмуванні, обробці тексту, а також у різних програмах та інструментах для роботи з даними.
'''

'''
Основні компоненти регулярних виразів включають:

1. Літерали. Пряме відображення символів (наприклад, a, B, 1).
2. Метасимволи. Символи, які мають спеціальне значення в регулярних виразах (наприклад, . (крапка) відповідає будь-якому символу).
3. Квантифікатори. Визначають, скільки разів елемент повинен відповідати (наприклад * означає 0 або більше повторень).
4. Класи символів. Визначають групи символів (наприклад, [a-z] відповідає будь-якій малій літері).
5. Групи та діапазони. Використовуються для групування частин виразу (наприклад, (abc) визначає групу символів).
6. Альтернації. Відповідає одному з декількох шаблонів (наприклад, a|b відповідає a або b).
7. Якорі. Визначають позиції у тексті (наприклад, ^ для початку рядка, $ для кінця рядка).
'''
'''
Регулярні вирази можуть бути досить складними, але вони надзвичайно потужні для розширеного пошуку та обробки тексту. Вони широко використовується у багатьох мовах програмування, а не тільки у Python.

Регулярні вирази дозволяють шукати певні шаблони в рядках, виконувати заміни, розбивати рядки на частини і багато іншого. Для роботи з регулярними виразами в Python використовується модуль re.
'''
'''
Основні функції модуля re які ми розглянемо далі це:

1. re.search(pattern, string) - виконує пошук першого входження шаблону в рядку.
2. re.findall(pattern, string) - виконує знаходження всіх входжень шаблону в рядку.
3. re.sub(pattern, repl, string) - виконує заміну входжень шаблону на інший рядок.
4. re.split(pattern, string) - виконує розбивання рядка за шаблоном.
'''
'''
Основне завдання регулярних виразів — це пошук рядка, або підрядка, який відповідає опису в термінах регулярних виразів.
'''
'''
Використовуючи цей механізм можна робити наступні операції:

- перевіряти, що рядок відповідає деяким вимогам (це номер телефону або email);
- розділяти рядки на підрядки за деяким виразом (розбити текст на речення, використовуючи усі розділові знаки, а не тільки якийсь один);
- замінювати підрядок в рядку (замінити усі слова, що починаються на деяку послідовність);
- знаходити підрядок в рядку, який відповідає виразу.

Регулярні вирази знаходять застосування в багатьох областях, включаючи обробку тексту, валідацію даних, парсинг і скрапінг веб-сторінок, пошук і заміна в текстових редакторах та багато іншого. Вони є потужним інструментом для будь-якого програміста, який працює з текстовими даними.

Регулярний вираз або коротко "регулярка" складається зі звичайних символів і спеціальних командних послідовностей. Наприклад, \d задає будь-яку цифру, а \d+ — задає будь-яку послідовність з однієї або більше цифр. Це називається шаблони регулярних виразів.
'''
'''
Регулярні вирази використовують спеціальні символи для створення шаблонів. Вони складаються з блоків та модифікаторів.

Прикладом блоку може бути:

- \w — будь-яка цифра або буква [a-zA-Z0-9_] (\W — все, крім букви або цифри [^a-za-z0-9_])
- \d — будь-яка цифра [0-9] (\D — усе, крім цифри [^0-9])
- \s — будь-який пробільний символ [\t\n\r\f\v] (\S — усе, крім пробільних символів [^\t\n\r\f\v])
- \b — межа слова
- [...] — один із символів у дужках ([^ ] — будь-який символ, крім тих, що в дужках)
- ^ і $ — початок і кінець рядка відповідно
- ( ) — групує вираз і повертає знайдений текст
- \t, \n, \r — символ табуляції, нового рядка та повернення каретки
'''
'''
Модифікатори можуть вказувати на кількість повторень блоку у виразі, наприклад:

- . — один будь-який символ, крім рядка \n
- ? — 0 або 1 входження шаблону зліва
- + — 1 і більше входжень шаблону зліва
- * — 0 і більше входжень шаблону зліва
- \ — екранування спеціальних символів (приклад: \. — означає крапку або \+ — знак "плюс")
- {n} суворо n разів (n ціле число)
- {n,m} — від n до m входжень (приклад: {,m} — від 0 до m)
- a|b — відповідає a або b. Сам символ | означає "або" між двома шаблонами
- ( ) — групує вираз і повертає знайдений текст

Кожен з цих елементів дозволяє створювати гнучкі та потужні шаблони пошуку в тексті за допомогою регулярних виразів. Саме складання регулярних виразів — це дуже велика тема варта окремого вивчення. Але базові засади створення регулярних виразів ми з вами розберемо.
'''
#Для роботи з регулярними виразами у Python є стандартний модуль re. Щоб скористатися цим модулем, його потрібно спочатку імпортувати:

import re

#Загальним для усіх функцій модуля re є те, що першим аргументом йде регулярний вираз у вигляді рядка.

