# Модуль 3 | Дата, час та рядки
# Тема: Search method
# Розглянуто:
# -----------------------------------------------

#Метод search

'''
Модуль re у Python надає інструменти для роботи з регулярними виразами. Одна з основних функцій цього модуля - re.search(), яка використовується для пошуку першого входження шаблону в рядку. Регулярний вираз - це шаблон, який використовується для знаходження певних комбінацій символів у рядках.
'''

#Синтаксис:

#re.search(pattern, string)

#pattern: Регулярний вираз (шаблон), який ви хочете знайти.
#string: Рядок, у якому ви хочете знайти шаблон.

'''
Результат виконання re.search() це спеціальний об'єкт Match, якщо знаходить відповідність. Якщо відповідність не знайдена, повертає None.
'''

#Об'єкт Match має властивості та методи, що використовуються для отримання інформації про пошук та результат:
'''
- Match.span() повертає кортеж, що містить початкову та кінцеву позиції збігу.
- Match.string повертає рядок, переданий у функцію.
- Match.group() повертає частину рядка, в якому був збіг.'''

#Ви можете використати метод .group() у цьому об'єкті, щоб отримати відповідну частину рядка.

#Наприклад, виконаємо пошук слова "Python" у рядку.

import re

text = "Вивчення Python може бути веселим."
pattern = "Python"
match = re.search(pattern, text)

if match:
    print("Знайдено:", match.group())
else:
    print("Не знайдено.")

#У цьому прикладі ми шукаємо пряме входження слова "Python". Якщо знаходимо, виводимо знайдене слово. Виведення:
#Знайдено: Python

#Тепер використаємо метасимволи, та виконаємо пошук слова, що починається на "в" та закінчується на "м".


import re

text = "Вивчення Python може бути веселим."
pattern = r"в\w*м"
match = re.search(pattern, text, re.IGNORECASE)

if match:
    print("Знайдено:", match.group())

#Тут змінна pattern зберігає регулярний вираз r"в\w*м":

# - r означає "сирий" рядок (raw string), який каже Python ігнорувати спеціальні символи такі як \n, \t тощо, оскільки це рядок для регулярних виразів.
# - в - шукаємо слово яке починається на букву "в".
# - \w* - це означає будь-яка кількість букв включно з нулем букв. Бо \w відповідає будь-якому "словесному" символу, а * є квантифікатором, який означає "нуль або більше входжень попереднього елемента".
# - м - шукаємо слово яке закінчується на "м".

#Виведення:
#Знайдено: веселим

#Розглянемо простеньку задачу - знаходження електронної адреси в рядку.

import re

text = input("Введіть рядок: ")  # "Моя електронна адреса: example@example.com"
pattern = r"\w+@\w+\.\w+"
match = re.search(pattern, text)

if match:
    print("Електронна адреса:", match.group())
else:
    print("Електронна адреса не знайдена.")


'''
У цьому прикладі регулярний вираз \w+@\w+\.\w+ шукає електронну адресу:

- \w+ - спочатку повинні йти одна або більше букв або цифр.
- @ - далі обов'язково повинен бути символ @.
- \w+ - після символу @ повинна йти ще одна серія букв.
- \. - серія букв повинна закінчитись символом крапки. Ми екрануємо його, бо в регулярному виразі, крапка є модифікатором та має спеціальне значення.
- \w+ - далі йде серія букв після крапки.
'''

#Отже функція re.search за цим шаблоном повинна знайти електронну адресу в рядку. Виведення:
#Електронна адреса: example@example.com

'''
Цей приклад демонструє регулярний вираз до складного шаблону, такого як електронна адреса. Але треба сказати, що “справжні” регулярні вирази для пошуку електронної адреси набагато складніші, ми використали мінімально необхідний.'''

'''
Припустимо, у нас є рядок з електронною адресою, і ми хочемо вилучити ім'я користувача та домен цієї електронної адреси окремо. Треба розділити "username@domain.com" на "username" (ім'я користувача) та "domain.com" (домен).'''

#Розв'язок:
import re

email = "username@domain.com"
pattern = r"(\w+)@(\w+\.\w+)"
match = re.search(pattern, email)

if match:
    user_name = match.group(1)
    domain_name = match.group(2)
    print("Ім'я користувача:", user_name)
    print("Домен:", domain_name)

#Виведення:
#Ім'я користувача: username
#Домен: domain.com

#my example

import re

email = input("Введіть електронну адресу: ")  # "username@domain.com"
pattern = r"(\w+)@(\w+\.\w+)"
match = re.search(pattern, email)

if match:
    user_name = match.group(1)
    domain_name = match.group(2)
    print("Ім'я користувача:", user_name)
    print("Домен:", domain_name)
else:
    print("Невірний формат електронної адреси.")

'''
Давайте трошки зроби пояснення, що тут відбулося. Головне це наш регулярний вираз (\w+)@(\w+\.\w+). Перші круглі дужки (\w+) відповідають одному або більше словесним символам. Це група збігається з ім'ям користувача електронної адреси. Далі в нас відбувається пошук @ - символ, що розділяє ім'я користувача та домен. Він нам не потрібний і в дужки ми його не беремо. Другі круглі дужки (\w+\.\w+) відповідають за домен електронної адреси. Тут \w+ збігається з першою частиною домену, \. - це крапка, і ще один \w+ для збігу з доменом верхнього рівня (наприклад, "com").

Коли re.search() знаходить відповідність, вона повертає об'єкт Match. Методи match.group(1) та match.group(2) використовуються для вилучення тексту, що відповідає кожній групі в шаблоні.



Цей приклад показує, як круглі дужки можуть бути корисними для групування та вилучення специфічних частин тексту в регулярних виразах.
'''
