# Модуль 3 | Дата, час та рядки
# Тема: Correct comparison of real numbers
# Розглянуто:
# -----------------------------------------------

#Правильне порівняння дійсних чисел

'''
Дійсні числа в комп'ютерних програмах часто можуть викликати неточності через їхню бінарну природу. 
Це може призвести до несподіваної поведінки при порівнянні чисел. 
Розглянемо кілька прикладів та способи їх порівняння в Python.
'''
#Виконаємо наступне пряме порівняння
print(0.1 + 0.2 == 0.3)  # Це повертає False

'''Цей код повертає False через неточності в представленні дійсних чисел в сучасних комп'ютерах. 
Числа 0.1 і 0.2 не можуть бути представлені точно як двійкові дроби всередині комп'ютера,
тому їх сума не буде точно дорівнювати 0.3.'''

print(0.1 + 0.2) #Виведе 0.30000000000000004


#Функція math.isclose використовується для порівняння двох чисел з певною допустимою похибкою. 
# Це корисно для порівняння дійсних чисел, де пряме порівняння може бути ненадійним.

import math

r = math.isclose(0.1 + 0.2, 0.3)
print(r)  # Це поверне True

#Також ми можемо виконувати порівняння з маленькою похибкою:

import math

r = math.isclose(0.1, 0.10000000009)
print(r)  # Це поверне True

#У цьому прикладі math.isclose знову використовується для порівняння двох чисел
# , де друге число відрізняється від першого на дуже малу величину.

#Ці приклади демонструють, як ефективно порівнювати дійсні числа в Python, 
# уникаючи поширених пасток, пов'язаних із точністю представлення цих чисел.