#Модуль math

'''
Пакет math у Python надає доступ до математичних функцій, визначених стандартом мови C. 
Цей пакет включає функції для різних математичних операцій, включаючи тригонометричні обчислення, логарифми, квадратний корінь та інше.

Розглянемо деякі з ключових функцій і констант, які надає цей пакет:

Константи:
- math.pi - константа π (приблизно 3.14159...);
- math.e - константа e, основа натуральних логарифмів (приблизно 2.71828...);
- math.tau - константа τ, дорівнює 2π (приблизно 6.28318...);
- math.inf - позначення нескінченності;
- math.nan - позначення 'Not a Number' (не число);

Функції округлення чисел:
- math.ceil(x) - виконує округлення дійсного числа x до найближчого більшого цілого числа;
- math.floor(x) - виконує округлення дійсного числа x до найближчого меншого цілого числа;
- math.trunc(x) - виконує обрізання дробової частини дійсного числа x, та повертає цілу частину числа;
'''
#Приклад використання:
import math

# Вихідне число
x = 3.7

# Використання різних методів округлення
ceil_result = math.ceil(x)  # Округлення вгору
floor_result = math.floor(x)  # Округлення вниз
trunc_result = math.trunc(x)  # Відсікання дробової частини

print(ceil_result, floor_result, trunc_result)
# Вивід: 4 3 3

'''
Тригонометричні функції

- math.sin(x) - синус x, де x в радіанах;
- math.cos(x) - косинус x;
- math.tan(x) - тангенс x;
- math.asin(x) - арксинус x;
- math.acos(x) - арккосинус x;
- math.atan(x) - арктангенс x;
'''
'''
Експоненційні та логарифмічні функції
- math.exp(x) - число e в ступені x;
- math.log(x[, base]) - Логарифм x за основою base. 
Якщо base не вказано, обчислюється натуральний логарифм;
'''
'''
Ступінь та корінь

- math.pow(x, y) - x у ступені y;
- math.sqrt(x) - квадратний корінь з x;
'''
'''
Деякі інші функції

- math.fabs(x) - модуль (абсолютне значення) x;
- math.factorial(x) - факторіал числа x;
- math.gcd(x, y) - найбільший спільний дільник для x та y;
'''

#Приклад використання пакета math

import math

# Використання констант
print(math.pi)  # Виведе приблизне значення π

# Тригонометрія
angle = math.radians(60)  # Конвертація з градусів у радіани
print(math.sin(angle))  # Синус кута

# Корінь числа
print(math.sqrt(9))  # Квадратний корінь з 9

# Логарифми
print(math.log(10, 2))  # Логарифм 10 за основою 2
#Виведення: 
# 3.321928094887362 
# 0.8660254037844386
# 3.0
# 3.321928094887362


#Якщо вам потрібна комплексна математика, то можна скористатися пакетом cmath. 
# Він надає той самий API, але вміє працювати з комплексними числами.