#Робота з ISO форматом дати

'''
ISO формат дати відноситься до міжнародного стандарту представлення дат і часу, відомого як ISO 8601. 
Цей стандарт створений Міжнародною організацією стандартизації (ISO) та використовується для уніфікації представлення дати та часу у всьому світі
'''

'''
Формат дати в ISO 8601 виглядає як "YYYY-MM-DD", де:
- "YYYY" - це чотиризначний рік (наприклад, 2023),
- "MM" - це двозначний місяць (від 01 до 12)
- "DD" - це двозначний день місяця (від 01 до 31)

#Формат часу в ISO 8601 виглядає як "HH:MM:SS", де:
- "HH" - години (від 00 до 23),
- "MM" - хвилини (від 00 до 59),
- "SS" - секунди (від 00 до 59, іноді з додатковими десятковими частинами для мікросекунд).
'''
'''
Повне представлення дати та часу в ISO 8601 поєднує ці два формати з "T" між ними, наприклад "YYYY-MM-DDTHH:MM:SS".
Це відділяє дату від часу і формат легко відрізняється від інших представлень.

ISO 8601 також підтримує представлення часових зон. Наприклад, "Z" на кінці означає UTC (координований всесвітній час), а відхилення від UTC може бути представлене як "+HH:MM" або "-HH:MM". 
Термін UTC, що розшифровується як Всесвітній координований час (англ. Coordinated Universal Time), є основною системою часу, від якої регулюються всі часові зони у світі. 
Він використовується як світовий стандарт часу. Він не змінюється з порами року та не підлягає переходу на літній/зимовий час, на відміну від багатьох місцевих часових зон.

Через свою універсальність, UTC широко використовується в міжнародних комунікаціях, авіації, астрономії та інших галузях. 
Локальні часові зони часто визначаються як UTC плюс або мінус певна кількість годин.
'''
'''
Модуль datetime надає зручні інструменти для роботи з датами та часом у форматі ISO 8601. 
Об'єкт datetime можна легко перетворити в рядок формату ISO 8601 за допомогою методу isoformat():
'''
from datetime import datetime

# Поточна дата та час
now = datetime.now()

# Конвертація у формат ISO 8601
iso_format = now.isoformat()
print(iso_format)
#Виведе:
# 2026-05-21T00:47:17.123456

#Для зворотного перетворення рядка у форматі ISO 8601 на об'єкт datetime, можна використати метод fromisoformat():
from datetime import datetime

iso_date_string = "2026-03-14T12:39:29.992996"

# Конвертація з ISO формату
date_from_iso = datetime.fromisoformat(iso_date_string)
print(date_from_iso)
#Виведе:
# 2026-03-14 12:39:29.992996

'''
Метод isoweekday() у об'єкті datetime використовується для отримання дня тижня відповідно до ISO 8601.
Згідно з цим стандартом, тиждень починається з понеділка, який має значення 1, і закінчується неділею, яка має значення 7.
'''

from datetime import datetime

# Створення об'єкта datetime
now = datetime.now()

# Використання isoweekday() для отримання дня тижня
day_of_week = now.isoweekday()

print(f"Сьогодні: {day_of_week}")  # Поверне число від 1 до 7, що відповідає дню тижня

#У цьому прикладі day_of_week буде містити число від 1 до 7, де 1 відповідає понеділку, а 7 - неділі. Для четверга виведення буде:
# Сьогодні: 4

#Метод isoweekday() корисний у сценаріях, де потрібно визначити конкретний день тижня, наприклад, при плануванні подій або виконанні дій, залежних від дня тижня.
#Це може бути особливо корисним у бізнес-логіці, яка оперує робочими та вихідними днями.



#------------------------------------------------------------
#My example:
#Щоб отримати конкретний день, використовуйте datetime():
from datetime import datetime

# Конкретна дата: рік, місяць, день
my_date = datetime(2024, 11, 25)

day_of_week = my_date.isoweekday()
print(f"День тижня: {day_of_week}")  # 1=Пн, 7=Нд
#Виведе:
# День тижня: 1

#Або завтрашній день через timedelta:

from datetime import datetime, timedelta

tomorrow = datetime.now() + timedelta(days=1) # Додаємо один день до поточної дати, або віднімаємо один день для вчорашнього дня
day_of_week = tomorrow.isoweekday()
print(f"Завтра: {day_of_week}") # Поверне число від 1 до 7, що відповідає дню тижня
#Виведе:
# Завтра: 5
#------------------------------------------------------------

'''

Також розглянемо корисний метод isocalendar(), 
який використовується для отримання кортежу, що містить ISO рік, 
номер тижня в році та номер дня тижня відповідно до ISO 8601.
'''

''''
Виведення isocalendar() - це кортеж (ISO_рік, ISO_тиждень, ISO_день_тижня), де:

- ISO_рік - це рік у форматі ISO.
- ISO_тиждень - номер тижня в році за ISO 8601 (від 1 до 53).
- ISO_день_тижня - день тижня за ISO 8601, де 1 означає понеділок, а 7 - неділю.
'''
from datetime import datetime

# Створення об'єкта datetime
now = datetime.now()

# Отримання ISO календаря
iso_calendar = now.isocalendar()

print(f"ISO рік: {iso_calendar[0]}, ISO тиждень: {iso_calendar[1]}, ISO день тижня: {iso_calendar[2]}")

#У цьому прикладі iso_calendar буде містити три значення: ISO рік, номер тижня та номер дня тижня,
#  у форматі datetime.IsoCalendarDate(year=2023, week=50, weekday=4).
#  Виведення до 14.12.2023 буде:
# ISO рік: 2023, ISO тиждень: 50, ISO день тижня: 4

'''
Метод isocalendar() корисний у ситуаціях, коли потрібно працювати з тижневими інтервалами або розраховувати дати у форматі,
який широко використовується в бізнес-плануванні та логістиці. 
Він також може бути корисним для визначення конкретного тижня року для подій або при плануванні завдань.
'''

###Ключові аспекти: методи для роботи з ISO форматом дати###

'''
Отже, коротко підсумуємо використання методів, які ми щойно розглянули:

- Метод isoformat() використовується для конвертації об'єкта datetime в рядок у форматі ISO 8601.
- Метод fromisoformat() використовується для конвертації рядка у форматі ISO 8601 в об'єкт datetime.
- Метод isoweekday() використовується для отримання дня тижня відповідно до ISO 8601.
- Метод isocalendar() використовується для отримання кортежу, що містить ISO рік, 
номер тижня в році та номер дня тижня відповідно до ISO 8601.
'''