#Робота з часовими зонами

#Щоб вивести дату у форматі UTC це можна зробити, додавши інформацію про часову зону до об'єкта datetime:

from datetime import datetime, timezone

local_now = datetime.now()
utc_now = datetime.now(timezone.utc)

print(local_now)
print(utc_now)  # Виведе поточний час в UTC
#Виведе:
# 2026-05-21 00:47:17.123456
# 2026-05-21 00:47:17.123456+00:00

'''
Щоб перетворити час з UTC в іншу часову зону, вам знадобиться визначити об'єкт timezone з відповідним зсувом. 
Наприклад, для перетворення UTC часу в час, що відповідає Східному часовому поясу США (UTC-5 годин), можна зробити наступне:
'''
from datetime import datetime, timezone, timedelta

utc_time = datetime.now(timezone.utc)

# Створення часової зони для Східного часового поясу (UTC-5)
eastern_time = utc_time.astimezone(timezone(timedelta(hours=-5)))
# Перетворює час UTC в час Східного часового поясу
print(eastern_time)  

#Виведе поточний час в Східному часовому поясі США (UTC-5)
# 2026-05-20 19:47:17.123456-05:00

'''
Щоб перетворити локальний час у час UTC, спочатку потрібно призначити
локальному часу відповідну часову зону, а потім використати метод astimezone() для конвертації його в UTC:'''
from datetime import datetime, timezone, timedelta

# Припустимо, місцевий час належить до часової зони UTC+2
local_timezone = timezone(timedelta(hours=2)) # Створення об'єкта timezone для UTC+2
local_time = datetime(year=2023, month=3, day=14, hour=12, minute=30, second=0, tzinfo=local_timezone) # Створення об'єкта datetime з інформацією про часову зону

# Конвертація локального часу в UTC
utc_time = local_time.astimezone(timezone.utc) # Перетворює локальний час в UTC
print(utc_time)  # Виведе час в UTC

#У цьому прикладі, ми створили об'єкт datetime 
#з часовою зоною UTC+2 (Київ) та перетворили його в час UTC. Виведення:
# 2023-03-14 10:30:00+00:00

'''
Стандарт ISO 8601 також підтримує часові зони.
У Python це можна зробити, додавши інформацію про часову зону до об'єкта datetime:
'''
from datetime import datetime, timezone, timedelta

# Час у конкретній часовій зоні
timezone_offset = timezone(timedelta(hours=2))  # Наприклад, UTC+2
timezone_datetime = datetime(year=2023, month=3, day=14, hour=12, minute=30, second=0, tzinfo=timezone_offset)

# Конвертація у формат ISO 8601
iso_format_with_timezone = timezone_datetime.isoformat()
print(iso_format_with_timezone)
#Виведе:
# 2023-03-14T12:30:00+02:00

#Ці методи в datetime модулі сприяють ефективній і простій роботі з ISO форматом, 
# дозволяючи легко інтегрувати стандартизоване представлення дат та часу в Python-програми.


#Ключові аспекти: методи для роботи з часовими зонами у Python

'''
Отже, ми розглянули такі методи та принципи роботи з ними:



Додавання інформації про часову зону до об'єкта datetime:
- Метод astimezone використовується для перетворення об'єкта datetime з однієї часової зони в іншу.
Наприклад, це може бути використано для конвертації часу з UTC в інші часові зони.

Перетворення локального часу в час UTC:
- Спочатку призначаємо локальному часу відповідну часову зону.
- Використовуємо astimezone для конвертації в UTC. 
Цей підхід допомагає зручно працювати з локальним та всесвітнім часом.

Форматування у форматі ISO 8601 із часовою зоною:
-Використовуємо isoformat для отримання рядка з об'єкта datetime у форматі ISO 8601 з часовою зоною.
 Це корисно для представлення дати та часу у єдиному стандартізованому вигляді.


'''