# Модуль 2 | Керування потоком та функції
# Тема: Task3 nested if expressions
# Розглянуто:
# -----------------------------------------------

#Вкладені вирази if

'''
Напишіть програму на Python, яка визначає характеристику введеного числа: чи воно додатне і парне, додатне і непарне, від'ємне, чи це нуль.

Задачі:

Запросіть користувача ввести ціле число і збережіть його у змінній num.
Використовуйте вкладені умовні вирази для аналізу числа:
Якщо число більше 0, перевірте, чи є воно парним або непарним:
Якщо число парне, залишок від ділення на 2 дорівнює 0, збережіть в змінній result рядок "Positive even number".
Якщо число непарне, залишок від ділення на 2 дорівнює 1, збережіть в змінній result рядок "Positive odd number".
Якщо число менше 0, збережіть в змінній result рядок "Negative number".
Якщо число дорівнює 0, збережіть в змінній result рядок "It is zero".
Очікуваний результат:

В залежності від результату перевірок, програма присвоює змінній result відповідне текстове повідомлення.

Підказки:

Використовуйте оператор залишку від ділення % для перевірки числа на парність.
Зверніть увагу на вірний порядок умовних виразів у вкладеній структурі if-elif-else.
'''

try:
    num = int(input("Enter a number: "))

    if num > 0:
        if num % 2 == 0:
            result = "Positive even number"
        else:
            result = "Positive odd number"
    elif num < 0:
        result = "Negative number"
    else:
        result = "It is zero"
    print(result)

except ValueError:
    print("Please enter a valid number.")