# Модуль 2 | Керування потоком та функції
# Тема: Task5 for loops
# Розглянуто:
# -----------------------------------------------

#Цикли for

'''
Напишіть програму на Python, яка підраховує кількість разів, коли заданий символ зустрічається в рядку.

Задачі:

Використовуючи зазначені змінні message, рядок, у якому буде виконуватися пошук, та search, символ, який ми шукаємо, підрахуйте, скільки разів символ search зустрічається в рядку message.
Для підрахунку використовуйте цикл for, який проходить через кожен символ у message.
Якщо поточний символ збігається з символом у змінній search, збільште змінну result на 1.
Збережіть кінцеву кількість входжень в змінну result.
Очікуваний результат:

Програма має зберегти в змінній result кількість разів, коли символ search зустрічається в рядку message.

Підказки:

Використовуйте == для порівняння поточного символу з символом, який шукаєте.
Пам'ятайте, що цикл for автоматично проходить через кожен символ у рядку.
'''

message = "Never argue with stupid people, they will drag you down to their level and then beat you with experience."
#search = "r"
search = input("Enter a character to search for: ")
result = 0
for char in message:
    if char == search:
        result += 1

print(result)