# Модуль 2 | Керування потоком та функції
# Тема: Fibonacci numbers
# Розглянуто:
# -----------------------------------------------

#Числа Фібоначчі

'''
Числа Фібоначчі — це послідовність чисел, у якій кожне наступне число є сумою двох попередніх. 
Перші два числа в цій послідовності, за визначенням, дорівнюють 0 і 1.
'''

#Математична формула для числа Фібоначчі:
#F(n) = F(n-1) + F(n-2) для n > 1
#F(0) = 0 для n = 0
#F(1) = 1 для n = 1

'''
Рекурсивний підхід до обчислення чисел Фібоначчі базується на прямому застосуванні цього визначення. 
Ось як його можна реалізувати:
'''
def fibonacci(n):
    if n <= 1: # базовий випадок
        return n
    else:
        return fibonacci(n-1) + fibonacci(n-2) # рекурсивний випадок

print(fibonacci(10)) # виведе 55
'''
1. Базовий випадок. якщо n <= 1, функція просто повертає.  Це відповідає визначенню перших двох чисел Фібоначчі:
 F(0) = 0 та F(1) = 1.

2. Рекурсивний випадок. Якщо n>1, функція повертає суму двох попередніх чисел Фібоначчі,
 обчислених за допомогою рекурсивних викликів: 
 F(n-1) та F(n-2). Це відповідає формулі F(n) = F(n-1) + F(n-2).
'''

'''
Тут основна ідея в тому, що кожне число Фібоначчі є сумою двох попередніх чисел Фібоначчі (за винятком перших двох чисел).
Тому щоб отримати $n$-е число Фібоначчі, вам потрібно додати (n-1) та (n-2) числа Фібоначчі. 
І цей процес продовжується рекурсивно, доки ви не дійдете до базового випадку.
'''
'''
Але що буде, якщо функція не матиме базового випадку і не повертатиме ніякого результату? 
Однією з потенційних проблем при використанні рекурсії є переповнення стеку.
Якщо рекурсивні виклики функції продовжуються без досягнення базового випадку, стек викликів може переповнитись, 
що призведе до помилки виконання. Така помилка називається переповненням стеку (stack overflow, саме на її честь було названо популярний сайт https://stackoverflow.com).
Багаторазові виклики функцій без повернення збільшують стек викликів доти, доки не буде витрачено всю виділену йому пам'ять комп'ютера.
'''

'''
Щоб цьому запобігти, інтерпретатори примусово завершують роботу програми після досягнення ліміту викликів функцій, які не повертають результат.
Така межа називається максимальною глибиною рекурсії, або максимальним розміром стеку викликів. 
У Python граничним значенням вважається 1000 викликів функцій.
'''