# Модуль 2 | Керування потоком та функції
# Тема: Recursion
# Розглянуто:
# -----------------------------------------------

#Рекурсія

'''
Рекурсія — це концепція в програмуванні, коли функція викликає саму себе в рамках власного виконання. 
Це схоже на дроблення великої проблеми на менші, керованіші проблеми.
'''

'''
Розглянемо декілька простих прикладів рекурсивних функцій, 
таких як обчислення факторіала числа або чисел Фібоначчі.
'''
#Але спочатку нам треба визначити основні компоненти рекурсії:

#1. Базовий випадок: Це умова, при якій рекурсія припиняє виклик самої себе, щоб уникнути нескінченного циклу. 
# Він важливий для запобігання нескінченному циклу в рекурсії.
#2. Рекурсивний випадок: Це умова, за якої функція викликає саму себе з новими аргументами. 
# Фактично це ситуація, коли функція продовжує викликати саму себе, розбиваючи проблему на менші частини

#Давайте розглянемо це на прикладі рекурсивної функції, яка обчислює факторіал числа.

#Факторіал натурального числа n(позначається як n!) — 
# це добуток всіх натуральних чисел від 1 до n включно. 

#Математичне визначення факторіала виглядає так:
'''
n! = n * (n - 1)! для n > 0
0! = 1 для n = 0
'''
#На основі цього визначення можна легко створити рекурсивну функцію для обчислення факторіала:
def factorial(n):
    if n == 0: # базовий випадок
        return 1
    else:
        return n * factorial(n-1) # рекурсивний випадок

print(factorial(5)) # виведе 120

#У цьому прикладі:
#- Базовий випадок: якщо n дорівнює 0, повернути 1. 
# Це припиняє рекурсію, оскільки не відбувається додатковий виклик функції factorial.
#- Рекурсивний випадок: якщо n не дорівнює 0, повернути **n,**помножену на factorial(n-1). 
# Ось тут і відбувається виклик функції factorial з аргументом, який на одиницю менший від поточного n, тому це є рекурсивний випадок.

'''
Цей код працює тому, що кожен виклик factorial(n-1) працює на дедалі меншому числі аж до того моменту, коли n дорівнює 0, і відбувається базовий випадок. 
На цьому етапі рекурсія завершується, і результат починає "повертатися" назад через усі попередні виклики функції, обчислюючи добуток на кожному кроці.
'''