#Стек викликів рекурсії

'''
Коли йдеться про рекурсію, ми зазвичай говоримо про функцію, яка викликає саму себе.
Проте щоб краще зрозуміти, як рекурсія функціонує, потрібно зрозуміти, як комп'ютер обробляє виклики функцій взагалі. 
Тут ми стикаємося з поняттям "стек викликів".
'''

'''
Стек викликів — це специфічна частина пам'яті, яка використовується для зберігання інформації про активні виклики функцій.
Кожен раз, коли функція викликається, створюється новий запис (або "шар") у цьому стеку для цього конкретного виклику. 
Цей шар містить інформацію про змінні функції, її параметри та місце, звідки була викликана функція, 
щоб після завершення виконання функції програма могла продовжити роботу з правильного місця.
'''
'''
Тож коли функція викликає себе рекурсивно, кожен новий виклик функції зберігається в стеку викликів. 
Сам стек викликів створює інтерпретатор Python під час виконання програми.
'''

'''
Якщо уявити стек як стопку книг, де кожна нова книга, яку ви кладете зверху, відображає новий виклик функції,
то рекурсія — це додавання нових книг на верх стосу. 
Коли функція завершує свою роботу, "книга" знімається зі стосу, і ми "повертаємося" до попередньої книги.
'''
'''
Отже, коли базовий випадок досягнуто, виклики функцій починають "розвантажуватись" зі стеку,
 що дозволяє розрахувати кінцевий результат.
Розглянемо приклад коду, який показує, як працює стек викликів у рекурсії на прикладі функції для обчислення факторіала числа:
'''
def factorial(n):
    print("Виклик функції factorial з n = ", n)
    if n == 1:
        print("Базовий випадок, n = 1, повернення 1")
        return 1
    else:
        result = n * factorial(n-1)
        print("Повернення результату для n = ", n, ": ", result)
        return result

print(factorial(5))

#Цей код обчислює факторіал числа 5, який дорівнює 5 * 4 * 3 * 2 * 1 = 120. 
#Коли ви запустите цей код, ви побачите послідовність викликів рекурсивної функції і повернення результатів.


'''
Цей приклад показує, як кожен виклик рекурсивної функції додає новий "шар" у стек викликів, а кожен повернений результат видаляє "шар".
Базовий випадок (тут це n == 1) дозволяє завершити рекурсію і почати повертати результати.
'''

#Виконаємо поглиблений аналіз нашого прикладу з факторіалом та додамо ілюстрації.

'''
Коли ви викликаєте factorial(5), створюється перший шар у стеку викликів для цього виклику.
Оскільки ця функція викликає себе знову, створюється ще один шар стеку для factorial(4),
потім ще один для factorial(3) і так далі, доки не буде досягнуто базового випадку factorial(1). 
У цей момент рекурсія досягла своєї найбільшої глибини, і стек викликів містить п'ять шарів.
'''

#Завершення виконання factorial(1) починає процес "розвантаження" стеку.

'''
Кожен шар, починаючи з останнього, обробляється, і результат кожного виклику повертається до попереднього виклику, 
доки весь стек не буде оброблений, і ми не отримаємо кінцевий результат для factorial(5).
'''