# QA сесія 18.04.26 | Основи веб
# Тема: 1.6
# Розглянуто:
# -----------------------------------------------

#Коли використоувати процеси так коли використовувати потоки?
#Потоки використовуються для виконання задач, які можуть бути виконані паралельно, але не потребують великої кількості ресурсів. Вони можуть бути корисними для задач, які вимагають багато часу на виконання, але не потребують великої кількості пам'яті або процесорного часу. 
# Процеси використовуються для виконання задач, які потребують великої кількості ресурсів або які можуть бути виконані незалежно від інших задач. Вони можуть бути корисними для задач, які вимагають багато пам'яті або процесорного часу, або для задач, які можуть бути виконаны паралельно без взаємодії між ними.
