# Модуль 2 | Керування потоком та функції
# Тема: Blocks of instructions and ternary operators
# Розглянуто:
# -----------------------------------------------

#Блоки інструкцій та тернарні оператори
'''
У Python особливий синтаксис стосовно виділення блоків інструкцій. Щоб інтерпретатор сприйняв набір інструкцій як окремий блок,
достатньо виділити всі інструкції цього блоку однаковою кількістю відступів зліва.
У Python рекомендується для виділення одного рівня вкладеності для блоку інструкцій використовувати 4 пробіли.
'''

x = int(input("X: "))
y = int(input("Y: "))

if x == 0:
    print("X can`t be equal to zero")
    x = int(input("X: "))

result = y / x

print(f"Result: {result}")

'''
Ви можете використати символи табуляції для виділення блоку інструкцій,
 це не помилка, але такий спосіб не рекомендується.

Синтаксичною помилкою буде змішати в одному файлі виділення блоків
 за допомогою табуляцій та пробілів одночасно, пам'ятайте про це.

Також можна виділяти декілька рівнів вкладеності, 
додаючи ще 4 пробіли зліва для всіх інструкцій блоку:'''

x = int(input("X: "))
y = int(input("Y: "))

if x == 0:
    print("X can`t be equal to zero")
    x = int(input("X: "))

    if x == 0:
        print("X can`t be equal to zero")
        x = int(input("X: "))

        if x == 0:
            print("X can`t be equal to zero")
            x = int(input("X: "))

result = y / x

print(f"Result: {result}")

''''^^^ В цьому прикладі тричі повторюється перевірка на нерівність x нулю,
 і на кожну перевірку блок інструкцій виділяється додатковими 4-ма пробілами. Сенсу в додаткових перевірках немає,
   це зроблено тільки заради демонстрації.'''

'''
Наведемо наступний приклад вкладеності для визначення чвертей для координатної площини, 
щоб закріпити розуміння блоку інструкцій.
 Даний фрагмент коду реалізує визначення квадранту точки з координатами x та y на координатній площині.
'''
if x >= 0:
    if y >= 0:  # x > 0, y > 0
        print("Перша чверть")
    else:  # x > 0, y < 0
        print("Четверта чверть")
else:
    if y >= 0:  # x < 0, y > 0
        print("Друга чверть")
    else:  # x < 0, y < 0
        print("Третя чверть")

'''
Умовні оператори вкладені один в одного, що означає, що перевірка умов відбувається поетапно, 
і якщо перша умова x >= 0 виконується, то програма переходить до внутрішнього блоку і перевіряє умову y >= 0.
 Якщо ця умова також виконується, то точка знаходиться в першій чверті. Якщо умова y >= 0 не виконується, то точка знаходиться в четвертій чверті.

Якщо умова x >= 0 не виконується, то програма переходить до наступного внутрішнього блоку, 
але вже для оператора else, де виконується перевірка умови y >= 0. Якщо ця умова виконується, 
то точка знаходиться в другій чверті, якщо ні - у третій чверті.

Отже, в результаті виконання даного коду буде виведена назва чверті,
 в якій знаходиться точка з координатами (x, y).

'''