# Модуль 2 | Керування потоком та функції
# Тема: Boolean algebra
# Розглянуто:
# -----------------------------------------------

#Булева алгебра

'''
Що робити, якщо у нас складна умова, яка поєднує в собі декілька вкладених умов? Наприклад, 
щоб користувач міг орендувати автомобіль, потрібно, 
щоб у користувача обов'язково було вказане ім'я, користувач був старший 18 і були водійські права.
'''
#В коді це виглядає наступним чином.

#Example#1
name = "Taras"
age = 22
has_driver_licence = True

if name and age >= 18 and has_driver_licence:
    print(f"User {name} can rent a car")

#Example#2
name = (input("Enter your name: "))
age = int(input("Enter your age: "))
has_driver_licence = input("Do you have a driver's license?(y/n): ").lower() == "y"

if name and age >= 18 and has_driver_licence:
    print(f"User {name} can rent a car")
else:
    print(f"User {name} can't rent a car")

#Ми бачимо, що тут з'явилися нова операція з and.
#  В Python для побудови логічних умов з декількох, використовується булева алгебра.

#Булева алгебра — це галузь математики, 
# яка займається вивченням істинності виразів та їх обробкою.

#Булева алгебра будується на трьох основних операціях: "і", "або", "ні".

'''
- AND (і): Операція повертає True, якщо обидва операнди є True. 
Наприклад, True AND True є True, в той час як True AND False є False.
- OR (або): Операція повертає True, якщо хоча б один з операндів є True.
 Наприклад, True OR False є True.
- NOT (ні): Унарна операція, яка інвертує значення; True стає False, а False стає True.

'''
'''
У Python оператори булевої алгебри — це оператори not, and, or. 
Булева алгебра є ключовою для умовних операторів та логічних умов в програмуванні. 
Вона дозволяє контролювати потік виконання програми
 (наприклад, за допомогою if-else умов в Python) та виконувати складні логічні перевірки.
'''
#Наприклад, нам треба визначити, чи введене користувачем число є парним двозначним числом:

num = int(input("Введіть число: "))

length = len(str(num))

if length == 2 and num % 2 == 0:
    print("Парне двозначне число")
else:
    print("Ні")

#Змінна length = len(str(num)) перетворює число в рядок str(num)
#  і обчислює його довжину за допомогою функції len(). 
# Ця довжина використовується для перевірки, чи число є двозначним.
'''
Далі умова if length == 2 and num % 2 == 0: перевіряє дві речі. Чи довжина числа length дорівнює 2 та чи число num є парним. 
Якщо обидві умови правильні, виводиться повідомлення "Парне двозначне число".
 Якщо умова в if не виконується, тобто число не є парним двозначним, виконується код після else, і виводиться повідомлення "Ні".

'''

'''У булевій алгебрі також важливі поняття булевої функції та булевих таблиць істинності, 
які використовуються для опису та аналізу логічних операцій. 
Булеві оператори в Python, такі як and, or, і not, є основними інструментами для побудови складних логічних умов. 
Вони використовуються для оцінки істинності або неправдивості виразів та є ключовими у процесі прийняття рішень у програмах.'''