# Модуль 2 | Керування потоком та функції
# Тема: Conditional code execution
# Розглянуто:
# -----------------------------------------------

'''
Послідовність виконання виразів у програмі називається «потік виконання» (Flow of execution).

У Python існує три способи управління потоком виконання:

умовне виконання — виконання блоку інструкцій тільки за деякої умови;
цикли — повторення виконання блоку інструкцій, доки виконується деяка умова;
винятки — механізм обробки помилок, що дозволяє керувати потоком програми при виникненні виняткових ситуацій (наприклад, помилок або інших непередбачених обставин).

Умовний оператор в Python - це конструкція мови, яка дозволяє виконувати певні дії в залежності від того, чи виконується певна умова.
'''
'''
Умовний оператор у Python має такий синтаксис:
if <умова>:
    <тіло if-блоку>
else:
    <тіло else-блоку>


    if <умова>: вираз, який повертає True або False
<тіло if-блоку> це набір інструкцій, які виконуються, якщо умова є True
<тіло else-блоку> це набір інструкцій, які виконуються, якщо умова є False. Блок else є необов'язковим і може бути опущеним.
'''

num = 15  # приклад значення для num

if num > 10:
    print("num більше за 10")
else:
    print("num не більше за 10")

num = int(input("Введіть число: "))

if num > 10:
    print("num більше за 10")
else:
    print("num не більше за 10")

#Наприклад, розглянемо наступний код, який визначає, що число x є парним:

x = int(input('Введіть число: '))

if x % 2 == 0:
    print("Число x є парним.")
else:
    print("Число x є непарним.")
