# Модуль 2 | Керування потоком та функції
# Тема: Control operator
# Розглянуто:
# -----------------------------------------------

'''
Що робити, якщо в нас є низка умов? Для цього у Python реалізований оператор контролю виконання if ... elif ... else. Оператор контролю виконання дозволяє виконувати блоки інструкцій не завжди, а тільки тоді, коли буде виконана умова.
Синтаксис умовного оператора:

-починається з ключового слова if, за яким йде умова;
-після умови ставиться двокрапка і з нового рядка з відступом йде блок інструкцій, які будуть виконані, якщо умова виконується;
-після блоку if може бути нуль або більше блоків elif, інтерпретатор послідовно перевірятиме усі умови elif зверху вниз, доки не знайде той, який виконується;
-потім може бути один блок else, який виконується, якщо всі попередні умови не виконуються.
'''
a = input('Введіть число')
a = int(a)
if a > 0:
    print('Число додатне')
elif a < 0:
    print("Число від'ємне")
else:
    print('Це число - нуль')

'''
код з помилкою
Проблама в коді
a = input('Введіть число')
a = int(a)

if a > 0:
    print('Число додатне')
elif a == 1: <-- #помилка полягає в тому, що перевірка elif a == 1: є надмірною та ніколи не виконується, оскільки умова if a > 0:
    вже включає в себе випадок, коли a дорівнює 1.  
    print('Число дорівнює 1')
else:
    print("a <= 0")

'''
# Correct code

a = input('Введіть число')
a = int(a)

if a == 1:
    print('Число дорівнює 1')
elif a > 0:
    print('Число додатне')
else:
    print("a <= 0")



