# Модуль 2 | Керування потоком та функції
# Тема: Cycle for
# Розглянуто:
# -----------------------------------------------

#Цикл for

'''
У Python цикл for використовується для перебору усіх елементів контейнерів або ітерованих об'єктів, наприклад, списків. 
Інструкції, які знаходяться у тілі циклу, будуть виконані стільки разів, скільки елементів у колекції.

При цьому на кожній ітерації спеціальна змінна набуває значення одного з елементів колекції.

Роботу циклу for можна порівняти з тим, що ви по черзі візьмете кожну літеру з фрази й промовите її. 
Фразою може виступати рядок 'apple', а аналогом вимовлення вголос буде виступати виведення відповідної літери в консоль.
'''

#fruit = 'apple'
fruit = input("Enter a fruit: ") #my example
for char in fruit:
    print(char)

'''
Синтаксис циклу for в Python включає кілька важливих компонентів:

-Цикл починається з ключового слова for, що вказує на початок циклу.
-Після for слідує назва змінної, яка буде використовуватися для зберігання поточного значення ітерації.
 Значення цієї змінної буде змінюватися з кожною ітерацією циклу.
-Далі йде ключове слово in, що вказує на об'єкт або діапазон, по якому буде відбуватися ітерація.
-Після in розміщується об'єкт або вираз, що визначає набір елементів або діапазон, по якому буде відбуватися ітерація.
-В кінці рядка ставиться двокрапка :, що відділяє заголовок циклу від його тіла.
-На новому рядку з відступом від початку рядка розміщуються інструкції або вирази, які потрібно виконувати на кожній ітерації.
 Відступ є обов'язковим, оскільки він визначає блок коду, який належить до циклу.
'''
'''
Розглянемо декілька прикладів, щоб краще розуміти як працює цикл for.
По будь-якій колекції можна пройти за допомогою циклу for 
і на кожній ітерації в циклі буде отримано один з елементів цієї колекції.
'''
alphabet = "abcdefghijklmnopqrstuvwxyz"
for char in alphabet:
    print(char, end=" ")
#У прикладі літери алфавіту з alphabet виводяться в консоль по черзі, через пробіл.

#Використаємо цикл for у Python для ітерації по елементах ітерованого об'єкта,
#  у нашому випадку — списку some_iterable.

some_iterable = ["a", "b", "c"]

for i in some_iterable:
    print(i)

'''
Цикл for використовується для послідовного проходження по кожному елементу списку some_iterable.
 В цьому циклі i є змінною, яка на кожній ітерації приймає значення поточного елемента з some_iterable. 
 На кожній ітерації виконується команда print(i), яка виводить поточний елемент списку.

'''
#Цикл for може використовуватися для перебору всіх чисел у списку 
# та отримання результату для кожного числа:
odd_numbers = [1, 3, 5, 7, 9]
for i in odd_numbers:
    print(i ** 2) #Код з цього прикладу виведе в консоль квадрати чисел списку odd_numbers.

#Розглянемо наступну задачу. 
# Користувач вводить рядок. 
# Треба порахувати скільки символів в рядку та скільки пробілів в рядку.
#  Як ми можемо написати код?

'''
Ми повинні скласти порядок дій для розв'язання цієї задачі:

Зчитування рядка від користувача.
Використання циклу for для перебору кожного символу в рядку.
Підрахунок загальної кількості символів 
та окремо кількості пробілів за допомоги циклу for та оператору if.
'''
# Зчитування рядка від користувача
user_input = input("Введіть рядок: ")

# Ініціалізація змінних для підрахунку символів та пробілів
total_chars = len(user_input)  # загальна кількість символів у рядку
space_count = 0  # кількість пробілів

# Підрахунок кількості пробілів
for char in user_input:
    if char == " ":
        space_count += 1

# Виведення результатів
print(f"Загальна кількість символів у рядку: {total_chars}")
print(f"Кількість пробілів у рядку: {space_count}")

'''
У цьому коді вираз len(user_input) використовується для підрахунку загальної кількості символів у введеному рядку. 
Цикл for проходить через кожен символ у рядку, і якщо символ є пробілом, умова char == " ",
 змінна space_count інкрементується (збільшується) на 1. В кінці, виводяться обидва результати - це загальна кількість символів та кількість пробілів.
'''