# Модуль 2 | Керування потоком та функції
# Тема: Cycles and dictionaries
# Розглянуто:
# -----------------------------------------------

#Цикли та словники

'''
Ітерування за словником — це такий блок коду, 
який дуже часто зустрічається при програмуванні, тож корисно вміти це робити.

'''

'''Спершу варто сказати, що словник сам по собі — це ітерований контейнер і за ним можна ітеруватися в циклі for без необхідності заводити якийсь зовнішній лічильник тощо.
 Створимо словник, в якому ключами будуть числа, а значеннями — числівники англійською:'''

numbers = {
    1: "one",
    2: "two",
    3: "three"
}

#Тепер давайте просто пройдемо словником в циклі та виведемо, що нам повертає ітератор на кожній ітерації:

for key in numbers:
    print(key)

'''У виведенні ви побачите:
1
2
3
'''
#Часто необхідно перебрати саме значення словника, для цього скористаємося методом values:

for val in numbers.values():
    print(val)

'''
У виведенні буде:
one
two
three
'''

#Щоб перебрати пари ключ значення словника треба використати метод items. 
# На кожній ітерації ми отримаємо пару (ключ, значення):
for key, value in numbers.items():
    print(key, value)
'''
У виведенні буде:
1 one
2 two
3 three'''