# Модуль 2 | Керування потоком та функції
# Тема: Enumerate function
# Розглянуто:
# -----------------------------------------------

#Функція Enumerate

'''Функція enumerate використовується для одночасного отримання індексу та значення елементів ітерованого об'єкта. 
Це корисно, коли вам потрібно отримати доступ до індексу елементів під час ітерації.

'''

some_list = ["apple", "banana", "cherry"]
for index, value in enumerate(some_list):
    print(index, value)

'''
У цьому прикладі enumerate(some_list) створює пари індекс-значення для кожного елемента в списку, 
і цикл for проходить по цих парах.

Виведе:

0 apple
1 banana
2 cherry
'''