# Модуль 2 | Керування потоком та функції
# Тема: Exception handling mechanism
# Розглянуто:
# -----------------------------------------------

#Механізм обробки винятків

'''
Для обробки винятків існує оператор try ... except .... Синтаксично цей оператор розпочинається з ключового слова try: (спробувати) 
та продовжується блоком коду, в якому ми чекаємо, що може статися помилка.

Далі йде блок обробки винятків except (крім), де можна вказати один або більше винятків.
 Якщо один із зазначених винятків станеться, то виконається наступний блок коду.

Цей блок не обов'язковий, але найчастіше потрібний. Він виконається, якщо станеться зазначений виняток (один із них, якщо їх декілька).

Якщо помилки можуть бути різні і обробляти їх потрібно теж по-різному, то можна додати декілька блоків except, 
у кожному вказати свою помилку і що робити, якщо вона станеться.

Потім іде необов'язковий блок, який розпочинається з ключового слова else. 
Цей код виконається, тільки якщо винятків не сталося.

станнім іде необов'язковий блок коду, який розпочинається з ключового слова finally, він виконається у будь-якому разі, 
незалежно від того, були помилки або ні.
'''

#У нашому прикладі обробка призначеного для користувача введення виглядатиме таким чином:

#val = 'a'
val = input("Enter a number: ")
try:
    val = int(val)
except ValueError:
    print(f"val {val} is not a number")
else:
    print(val > 0)
finally:
    print("This will be printed anyway")

'''
Винятки у Python — це дуже потужний інструмент, який часто використовується для управління потоком виконання,
 а не тільки для обробки помилок. У динамічних мовах ніколи не можна бути на 100% впевненим у тому, що користувач увів значення коректного типу,
 або що інший застосунок не повернув None замість int, наприклад.
'''

'''
Наївним розв'язанням цієї проблеми буде повсюдне використання перевірок if на коректність введеного користувачем або іншим застосунком значення.
 Просунутішим, зручнішим і прозорішим рішенням є використання механізму обробки винятків там, де вони можуть статися через некоректні вхідні дані.

'''

age = input("How old are you? ")
try:
    age = int(age)
    if age >= 18:
        print("You are adult.")
    else:
        print("You are infant")
except ValueError:
    print(f"{age} is not a number")
