#Винятки

'''
Перетворити в int або float можна не будь-який рядок. Наприклад, якщо користувач введе 'a', 
то інтерпретатор не зможе визначити, як перетворити символ a в ціле число, і викличе виняток ValueError.

int("a")
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
<ipython-input-6-d9136db7b558> in <module>
----> 1 int("a")

ValueError: invalid literal for int() with base 10: 'a'


Виключення у Python — це помилка на рівні інтерпретатора, 
викликана неможливістю виконати той або інший оператор з будь-яких причин
 (змінна не існує, синтаксична помилка, відсутній атрибут, операція ділення на нуль тощо).

'''
test = int("a")
print (test)

'''
У нашому прикладі (ввели 'а') інтерпретатор намагається перетворити рядок в тип int (ціле число), 
але як перетворити рядок 'a' у число не визначено і буде викликаний виняток із цього приводу.
'''

#Основні типи винятків у Python

'''
SyntaxError — синтаксична помилка.

IndentationError — помилка, яка виникає, якщо у виділенні блоків інструкцій пробілами допущена помилка.

TabError виникає, якщо в одному файлі використовувати пробіли і табуляції для виділення блоків інструкцій.

TypeError виникає, коли операція зі змінною цього типу неможлива.
'''

2 / 'a'

'''ValueError виникає, коли тип операнда відповідний, 
але значення таке, що операцію неможливо виконати.'''

int("a")

'''ZeroDivisionError — ділення на нуль.'''

