#«Нескінченні цикли» та break

'''
Бувають ситуації, коли необхідно вийти з циклу до завершення ітерації, не дочекавшись, доки станеться чергова перевірка умови. Для цього є команда break. 
Команда break зупиняє цикл в момент виклику і не завершує ітерацію.

'''

a = 0
while True:
    print(a)
    if a >= 20:
        break
    a = a + 1

'''В цьому прикладі умова циклу буде виконуватися завжди, адже True завжди буде True.
 Це приклад нескінченного циклу. Але через перевірку, що a >= 20,
 цей цикл завершиться, щойно в a буде значення 20 або більше.'''

#Нескінченні цикли часто застосовуються там, де потрібно взаємодіяти з клієнтом, 
# чекаючи введення від нього, і завершується тільки при настанні деякої умови.

#Наприклад echo скрипт, який виводить в консоль те, що ви введете, доки ви не введете рядок тексту exit:

while True:
    user_input = input()
    print(user_input)
    if user_input == "exit":
        break
