#Логічні вирази

'''
Умовний оператор if ... elif ... else у Python як умови може приймати змінні типу bool або будь-який вираз,
 який він виконає і результат перетворить в bool. Коли як умову в умовний оператор ми передаємо вираз, то вираз виконається, 
а результат його виконання буде перетворений в тип bool.

Для зручності у Python є механізм неявного приведення будь-якого типу до типу bool. Правила приведення до bool достатньо інтуїтивні.
'''
'''
Правило перше - число 0 приводиться до False (ціле, дійсне або комплексне). 
Це правило перетворення дуже важливе, оскільки дозволяє використовувати 
числові змінні безпосередньо в умовних виразах. Наприклад, у коді нижче ми пишемо if money: і якщо money дорівнює 0, умова вважається неправдивою, і виконується код у блоку else.
'''
#Example1:
money = 0
if money:
    print(f"You have {money} on your bank account")
else:
    print("You have no money and no debts")

#Example2:
pets = int(input("How many pets do you have? "))
if pets > 0:
    print(f"You have {pets} pets")
else: 
    print("You have no pets")

'''Правило друге - значення None приводиться до False. У коді нижче, якщо змінна result має значення None, умова if result: оцінюється як False, 
тому що None завжди вважається неправдивим (False) у булевому контексті. Таким чином в нас result є None, а значить виконується код у блоку else, і на екран виводиться повідомлення "Result is None, do something".
'''
#Example3:
result = None
if result:
    print(result)
else:
    print("Result is None, do something")

'''
Правило третє - порожній контейнер, порожній рядок тощо, приводиться до False. Розглянемо 
для прикладу просту взаємодію з користувачем та умовного виконання.
'''
#Example4:
user_name = input("Enter your name: ")

if user_name:
    print(f"Hello {user_name}")
else:
    print("Hi Anonym!")


'''
Правило останнє - все інше приводиться до True

Ці правила приведення до bool дозволяють писати умовні вирази у Python практично літературною англійською. 
В будь-якому разі, такий код стає дуже зрозумілим.
'''
#Example5:
name = input("Введіть ім'я: ")
if name:  # Читається як: "Якщо є ім'я"
    print(f"Привіт, {name}")