'''
Завдання: "Розумний сортувальник складу"
Уяви, що на твій склад приходять різні типи вантажів. Тобі потрібно написати програму, яка підкаже, в який сектор відправити товар залежно від його категорії.

Умова:

Користувач вводить назву категорії товару (category).

Використай match category:, щоб обробити такі варіанти:

Якщо "електроніка" — виведи: "Сектор А: Потрібен температурний контроль".

Якщо "інструменти" — виведи: "Сектор Б: Стелажі для важких предметів".

Якщо "одяг" або "взуття" — виведи: "Сектор В: Зона пакування та вішалок".

Для всього іншого — виведи: "Сектор Г: Тимчасове зберігання".

Підказка для "одяг або взуття":

У match-case можна об'єднувати варіанти через вертикальну риску | (вона означає "або"):

case "одяг" | "взуття":
'''
category = input("Enter the product category: ").lower().strip()

match category:
    case "електроніка":
        print("Сектор А: Потрібен температурний контроль")
    case "інструменти":
        print("Сектор Б: Стелажі для важких предметів")
    case "одяг" | "взуття":
        print("Сектор В: Зона пакування та вішалок")
    case _:
        print("Сектор Г: Тимчасове зберігання")

#Твоє фінальне випробування по match-case (QA Style)
'''
Завдання:

Користувач вводить код помилки (наприклад, 404).

Використай match code: (не забудь перетворити ввід у int!).

Обробка:

200 | 201 -> "OK: Запит успішний"

400 -> "Bad Request: Помилка в даних"

404 -> "Not Found: Сторінку не знайдено"

500 | 503 -> "Server Error: Проблема на стороні сервера"

_ -> "Unknown Code: Невідомий код помилки"
'''
try:

    match_code = int(input("Enter the error code: "))

    match match_code:
        case 200 | 201:
            print("OK: Запит успішний")
        case 400:
            print("Bad Request: Помилка в даних")
        case 404:    
            print("Not Found: Сторінку не знайдено")
        case 500 | 503:
            print("Server Error: Проблема на стороні сервера")
        case _:
            print("Unknown Code: Невідомий код помилки")
except ValueError:
    print("Введіть число")

