#Оператор match
'''
Оператор match, введений у Python починаючи з версії 3.10, 
є схожим на оператори switch-case в інших мовах програмування.
Він дозволяє порівнювати значення з декількома шаблонами
і виконувати різні блоки коду в залежності від того, який шаблон відповідає значенню.

'''

#Структура оператора match
'''
match змінна:
    case шаблон1:
        # виконати код для шаблону 1
    case шаблон2:
        # виконати код для шаблону 2
    case _:
        # виконати код, якщо не знайдено відповідностей
'''
'''Оператор match - це свого роду розширена і більш гнучка версія оператора if-elif-else.
 Він дозволяє порівнювати значення з рядом шаблонів і, 
залежно від відповідності, виконувати певні дії.'''

fruit = input("Enter a fruit: ")

match fruit:
    case "apple":
        print("This is an apple.")
    case "banana":
        print("This is a banana.")
    case "orange":
        print("This is an orange.")
    case _:
        print("Unknown fruit.")

'''
Цей оператор був введений для випадків, коли нам потрібно виконати різні дії в залежності від значення однієї змінної,
особливо коли таких варіантів багато. Раніше для цього ми використовували довгий ланцюжок if-elif-else,
але тепер оператор match робить код чистішим та простішим для розуміння.
'''

#Але оператор має більш розширену сферу використання. Наприклад використання змінних у шаблонах. Розглянемо приклад:

try:

    point = int(input("X: ")), int(input("Y: "))

    match point:
        case (0, 0):
            print("Точка в центрі координат")  
        case (0, y):
            print(f"Точка лежить на осі Y: y={y}")  
        case (x, 0):
            print(f"Точка лежить на осі X: x={x}") 
        case (x, y):
            print(f"Точка має координати:  x={x}, y={y}") 
        case _:
            print("Це не точка")
except ValueError:
    print("Введіть число")


#Також можна використовувати оператор match з колекціями. 
# Наприклад ми маємо список pets, який містить назви домашніх тварин.

pets = ["dog", "fish", "cat"]
#raw_input = input("Введіть тварин через кому (напр. dog, fish, cat): ")

# Перетворюємо введений рядок у список
#pets = [item.strip() for item in raw_input.lower().split(",")]
match pets:
    case ["dog", "cat", _]:
        # Випадок, коли є і собака, і кіт
        print("There's a dog and a cat.")
    case ["dog", _, _]:
        # Випадок, коли є тільки собака
        print("There's a dog.")
    case _:
        # Випадок для інших комбінацій
        print("No dogs.")
'''
В цьому випадку виведення буде "There's a dog.", 
бо тільки "dog" знаходиться на своєму місці. Тут match використовується для перевірки, 
чи містить список pets певні комбінації тварин.
 Причому важливо, що саме комбінації,
і саме тому в нас спрацював case ["dog", _, _]:, а не case ["dog", "cat", _]:, бо cat в списку pets знаходиться в кінці, а не після dog. Знак _ в шаблоні використовується як "заповнювач", що означає "будь-яке інше значення".
'''