#Оператор is

'''
Оператор is у Python використовується для перевірки того, чи два об'єкти вказують на одну і ту ж область пам'яті, 
тобто чи вони є одним і тим же об'єктом.

Цей  оператор відрізняється від оператора ==, який перевіряє рівність значень об'єктів.

Оператор is у Python використовується для перевірки ідентичності об'єктів, тобто для встановлення, 
чи дві змінні вказують на один і той самий об'єкт в пам'яті. 
Цей оператор, який часто називають оператором ідентичності, 
має особливе значення при роботі з незмінними типами даних, 
такими як числа та рядки. У випадку з незмінними типами даних Python може кешувати об'єкти, 
що іноді призводить до того, що оператор is повертає True для об'єктів з однаковими значеннями, 
як у випадку з дуже малими цілими числами або короткими рядками. 
Корисно мати цю інформацію для випадку, якщо ви зіткнетеся з таким винятком у своєму коді.
'''
#Example1:
a = [1, 2, 3]
b = a
c = [1, 2, 3]

print(a is b)  # True
print(a is c)  # False

#Example2:
product_name = None

if product_name is None:
    print("Product name is not defined")

product_name= input("Введіть назву знайденого товару: ")

if product_name is not None:
    print(f"Успіх! Тепер у змінній лежить об'єкт: {product_name}")