#Оператор and

#Оператор and використовується для перевірки, чи обидві умови є істинними. Вираз з and вважається True тільки тоді, коли обидва операнди істинні.
a = True and False  # False
print(a)

'''
Таблиця істинності для and:
A | B | A and B
True | True | True
True | False | False
False | True | False
False | False | False

Ця таблиця показує, що вираз A and B буде істинним тільки тоді,
 коли обидва операнди A і B істинні.
'''

#Оператор or 

'''Оператор or перевіряє, чи хоча б одна з умов є істинною. Вираз із or вважається True, "
"якщо принаймні один із операндів є істинним:'''

a = True or False  # True
print(a)

'''
Таблиця істинності для or:
A | B | A or B
True | True | True
True | False | True
False | True | True
False | False | False

З таблиці видно, що вираз A or B є істинним у всіх випадках, 
крім випадку, коли обидва операнди є неправдивими.
''' 

#Оператор not

'''
Оператор not використовується для інвертування істинності операнду.
 Якщо операнд істинний, not перетворює його на неправдивий, і навпаки:'''

a = not 2 < 0  # True
print(a)

#Example
a = int(input("Enter a number: "))

if not a < 2:
    print(f"The number {a} is not less than 2/True")
else:
    print(f"The number {a} is less than 2/False")

#У цьому прикладі, оскільки 2 < 0 є неправдивим (False), оператор not перетворює його на True.

'''
Таблиця істинності для not:
A | not A
True | False
False | True
'''
#завдання "FizzBuzz”

'''
написати програми, яка для заданого числа:

Виводить "Fizz", якщо число кратне якомусь певному числу (наприклад, 3);
Виводить "Buzz", якщо число кратне іншому певному числу (наприклад, 5);
Виводить "FizzBuzz", якщо число кратне обом цим числам;
В іншому випадку виводить саме число.
'''
# Задаємо конкретне число
num = int(input())
# Перевіряємо кратність
if num % 3 == 0 and num % 5 == 0:
    print("FizzBuzz")
elif num % 3 == 0:
    print("Fizz")
elif num % 5 == 0:
    print("Buzz")
else:
    print(num)
'''
Умова if num % 3 == 0 and num % 5 == 0 перевіряє, чи введене число кратне і 3, і 5 одночасно.
 Ця перевірка стоїть першою, оскільки вона є найспецифічнішою.

Якщо ця умова виконується, виводиться "FizzBuzz".
Якби ця перевірка була після інших, вона б ніколи не виконувалася,
тому що більш загальні умови (кратність 3 або 5) вже б були виконані.
Далі elif num % 3 == 0 перевіряє, чи число кратне тільки 3.
Ця умова виконується тільки якщо попередня умова (кратність і 3, і 5) не виконалася.
Якщо це правда, виводиться "Fizz". Умова elif num % 5 == 0 перевіряє, чи число кратне тільки 5. 
Як і попередня, ця умова виконується лише тоді, коли попередні перевірки не виявилися істинними. 
У випадку виконання цієї умови виводиться "Buzz". Якщо жодна з вищезазначених умов не виконалася, то else гарантує, що буде виведене саме число.

Порядок цих умов є ключовим, бо він забезпечує, що найспецифічніша перевірка - кратність і 3, і 5 має пріоритет, 
а потім перевіряються менш специфічні випадки - кратність окремо 3 або 5. Це запобігає випадкам, коли числа, які кратні і 3, і 5, 
були б неправильно оброблені через виконання менш специфічних умов.

 '''