# Модуль 2 | Керування потоком та функції
# Тема: Range function
# Розглянуто:
# -----------------------------------------------

#Функція Range

'''
Функція range у поєднанні з циклом for у Python є потужним інструментом для контролю повторення дій певну кількість разів. 
Цей механізм часто використовується для ітерації через послідовність чисел, 
що робить його особливо корисним для різних задач, від базових до складних алгоритмів.
'''

#Функція range створює послідовність чисел. Вона може бути використана різними способами:
#range(stop): Створює послідовність чисел від 0 до stop - 1.
#range(start, stop): Генерує числа від start до stop - 1.
#range(start, stop, step): Створює числа від start до stop - 1, з кроком step.

#Цей приклад використовує цикл for разом з range для ітерації через послідовність чисел.
for i in range(5):
    print(i)

#У цьому прикладі range(5) генерує послідовність чисел від 0 до 4.
#  Цикл for проходиться по цій послідовності, і змінна i приймає значення кожного числа в послідовності по черзі. 
# Це був приклад простої ітерації.

#My example
try:
    for i in range(int(input("Введіть кількість ітерацій: "))):
        print(i)
except ValueError:
    print("Будь ласка, введіть коректне число.")

#Ітерація з визначеним початком і кінцем ітерації. Приклад виведення чисел від 2 до 9.
for i in range(2, 10):
    print(i)

#Ітерація з кроком. Цей приклад виведе парні числа від 0 до 8.

for i in range(0, 10, 2):
    print(i)

#Функція range разом з циклом for є основою для структурованого повторення коду та важливою частиною багатьох алгоритмів і програм у Python. 
# Вони дають можливість легко маніпулювати послідовностями чисел для вирішення різноманітних задач.