# Модуль 2 | Керування потоком та функції
# Тема: Ternary operations
# Розглянуто:
# -----------------------------------------------

#Тернарні операції

'''
Тернарні оператори в Python є елегантним способом вираження умовних виразів у скороченій формі. 
Вони дозволяють вам вибирати між двома значеннями залежно від того, 
чи є певна умова істинною або неправдивою. 
Це робить код компактнішим і часто полегшує його читання.
'''
'''
У прикладі нижче, вираз state = "nice" if is_nice else "not nice" використовує тернарний оператор для присвоєння рядка "nice" змінній state,
 якщо is_nice є істинним True, і рядка "not nice",
 якщо is_nice є неправдивим False:
'''
is_nice = input("Are you nice? y/n: ").lower() == "y"
state = "nice" if is_nice else "not nice"
print(state)

''''
У цьому прикладі значенням змінної state буде рядок 'nice'.

Такий підхід дозволяє швидко перевірити умову,
 а не писати декілька рядків оператора if ... else ....
   Для порівняння, ось як виглядав би той самий вираз без використання тернарного оператора,
     а з використанням стандартного блоку if-else:
'''
is_nice = input("Are you nice? y/n: ").lower() == "y"
if is_nice:
    state = "nice"
else:
    state = "not nice"
print(state)

#Ще одним корисним варіантом тернарного оператора в Python 
# є використання оператора or для швидкого визначення значення.


some_data = input("Введіть дані: ")
msg = some_data or "Не було повернено даних"
print(msg)

'''В прикладі ми присвоїмо msg значення some_data,
 якщо some_data не є None (або іншим значенням,
 яке вважається неправдивим у Python, як False,
 порожній рядок, порожній список тощо). У випадку, якщо some_data є None або неправдивим, 
 msg отримає значення "Не було повернено даних". В нашому випадку msg буде містити рядок 'Не було повернено даних',
 це зручно, коли потрібно швидко перевірити значення та показати повідомлення, якщо значення some_data є None'''
'''
Без використання скороченої форми тернарного оператора з or, 
вираз msg = some_data or "Не було повернено даних" може бути переписаний з 
використанням стандартного умовного оператора if ... else ... наступним чином:'''
some_data = None
if some_data:
    msg = some_data
else:
    msg = "Не було повернено даних"
print(msg)