# Модуль 2 | Керування потоком та функції
# Тема: Ternary operations tasks from ai
# Розглянуто:
# -----------------------------------------------

'''
Завдання 1: "Статус складу"
Твоя CRM повинна виводити короткий звіт: чи є товар, чи він закінчився.
Умова:

Користувач вводить кількість товару quantity.

Створи змінну status.

Використовуючи тернарний оператор, присвой status значення "In stock", якщо товару більше 0, і "Out of stock", якщо 0 або менше.

Виведи результат.

'''

quantity = int(input("Enter quantity: "))
status = 'in stoke' if quantity > 0 else 'out of stock'
print(status)

'''
Завдання 2: "Розрахунок знижки"
Уяви, що на складі акція: якщо людина бере більше 10 одиниць товару, вона отримує знижку 10%, якщо менше — 0%.
Умова:

Користувач вводить amount (кількість одиниць).

Створи змінну discount.

За допомогою тернарного оператора запиши в discount число 10, якщо amount > 10, і 0 у іншому випадку.

Виведи повідомлення: "Ваша знижка: [discount]%".
'''


amount = int(input("Enter amount: "))
discount = 10 if amount > 10 else 0
print(f"Your discount: {discount}%")

'''
Це останнє завдання з цієї серії. Давай подивимось, як ти впораєшся з ним.

Умова:

Користувач вводить weight (вага посилки).

Створи змінну decision.

Використовуючи тернарний оператор, запиши "Accepted", якщо вага до 5 кг (включно), і "Rejected", якщо більше.

Виведи результат.

'''
weight = float(input("Enter weight: "))

decision = "Accepted" if weight <= 5 else "Rejected"

print(f"Your decision is {decision}")
