#Цикл while

'''
Цикл while у Python — це один із способів організації циклічного виконання коду. 
Він продовжує виконувати блок інструкцій, поки задана умова залишається істинною. 
Цикл while часто використовується, коли кількість ітерацій заздалегідь невідома або коли ітерації залежать від змінних,
 які можуть бути модифіковані в процесі виконання циклу.

'''

#Синтаксис циклу while наступний:

'''
while condition:
    # Блок коду для виконання
condition (умова) — це логічний вираз, який перевіряється перед кожною ітерацією циклу.
Якщо умова істинна True, код усередині блоку while виконується. 
Як тільки умова стає неправдивою False, виконання циклу припиняється.

'''
#Розглянемо приклад

try:
    #k = 0
    k = int(input("Введіть число: "))
    while k < 10:
        k = k + 1
        print(k)
except ValueError:
    print("Помилка: введіть ціле число.")

    '''У цьому прикладі, цикл while виконуватиметься, поки змінна k менша за 10. На кожній ітерації k збільшується на 1, і виводиться значення k. 
    Коли змінна k досягає значення 10, умова k < 10 стає неправдивою, і цикл припиняється.
    
   При використанні циклів while важливо забезпечити, що умова циклу змінюватиметься в процесі його виконання, щоб уникнути нескінченних циклів. 
    '''