# Модуль 2 | Керування потоком та функції
# Тема: While loop task from ai
# Розглянуто:
# -----------------------------------------------

'''Готовий до завдання з "Ліфтом"? Це закріпить твою навичку роботи з математикою всередині print.

Твоє завдання (повторюю для зручності):

people = 0

while people < 5:

Збільшуй people на 1.

Виводь: f"Зайшла людина №{people}. Місць залишилося: {5 - people}"

ПІСЛЯ циклу виведи: "Ліфт заповнений!"'''

try:
    people = int(input("Введіть кількість людей, які зайшли в ліфт: "))
    while people < 5:
        people = people + 1
        print(f"Зайшла людина №{people}. Місць залишилося: {5 - people}")
    print("Ліфт заповнений!")
except:
    print("Помилка: щось пішло не так!")