# Модуль 2 | Керування потоком та функції
# Тема: Zip function
# Розглянуто:
# -----------------------------------------------

#Функція Zip

'''
Функція zip використовується для ітерації по декількох ітерованих об'єктах одночасно. 
Вона "застібає" елементи з кожного ітерованого об'єкта, створюючи кортежі з цих елементів.

'''
list1 = ["зелене", "стигла", "червоний"]
list2 = ["яблуко", "вишня", "томат"]
for number, letter in zip(list1, list2):
    print(number, letter)

'''
У цьому випадку zip(list1, list2) об'єднує елементи з list1 та list2,
 і цикл for проходить по створеним словосполученням.

Виведення:
зелене яблуко
стигла вишня
червоний томат
'''
'''
Коли колекції, передані в zip, мають різну довжину, zip обробляє елементи до тих пір, поки не закінчаться елементи в найкоротшій колекції. 
Це означає, що ітерація припиняється, як тільки буде досягнутий кінець однієї з колекцій, і будь-які додаткові елементи в інших, більш довгих колекціях, ігноруються.
'''
list1 = [1, 2, 3]
list2 = ['a', 'b', 'c', 'd', 'e']

for number, letter in zip(list1, list2):
    print(number, letter)

'''
У цьому прикладі list1 має 3 елементи, тоді як list2 має 5 елементів.
 Оскільки list1 є коротшим, zip припинить ітерацію після третьої пари значень.
 Результат буде:

1 a
2 b
3 c

Елементи 'd' та 'e' з list2 у цьому випадку будуть проігноровані.
'''