# Модуль 2 | Керування потоком та функції
# Тема: Сompleting the iteration with continue
# Розглянуто:
# -----------------------------------------------

#Завершення ітерації за допомогою continue

'''
Також для того, аби одразу перейти до наступної ітерації циклу без виконання виразів, 
що залишилися, є команда continue. 
Виклик цієї команди у тілі циклу призводить до того, що вирази цієї ітерації, що залишилися, не будуть виконані,
 а інтерпретатор одразу перейде до наступної ітерації або перевірки умови.
'''

a = 0
while a < 6:
    a = a + 1
    if not a % 2:
        continue
    print(a)
#У цьому прикладі цикл while виконується, поки a менше 6. На кожній ітерації a збільшується на 1.

#Інструкція print(a) не виконувалась, коли a ділилося на 2 без залишку, 
# оскільки ітерація завершувалася за допомогою continue.

'''
В цьому прикладі використовувався оператор отримання залишку від ділення %, 
він повертає таке число p, що якщо його відняти від r, то результат буде ділитися на x націло: (r - p) / x = a, де а, x, r — цілі числа.

for i in range(1, 10):
    if i % 2 == 0:
        print(f”{i} є парним числом.“)
    else:
        print(f”{i} є непарним числом.“)
'''

#Оператори continue та break працюють тільки всередині одного циклу. 
# В ситуації вкладених циклів немає способу вийти з усіх циклів одразу.

while True:
    number = input("number = ")
    number = int(number)
    while True:
        print(number)
        number = number - 1
        if number < 0:
            break
'''
В цьому прикладі користувач вводить число та отримує зворотний відлік від цього числа до 0 в консолі. 
При цьому, зовнішній нескінченний цикл жодним чином не перервати і break вийде тільки з внутрішнього циклу.
'''

#Також використання continue або break поза циклом призводить до синтаксичної помилки.
'''number = int(input("number = "))
if number < 0:
    break
 '''
#Такий код призводить до помилки SyntaxError. Такі помилки називаються винятками.
