# Модуль 1 | Вступ до Python
# Тема: M 1 hw3
# Розглянуто:
# -----------------------------------------------

#Створіть програму на Python, яка розраховує загальну вартість 
# споживання електроенергії, враховуючи різні тарифи для денного та нічного часу.

#Задачі:
#В змінній rate зберігається вартість одного кіловата електроенергії за денним тарифом. Встановіть для цієї змінної значення 1.68.
#Визначте нічний тариф як половину денного тарифу.
#У змінній value_day зберігайте показання лічильника за день, а в value_night — за ніч. Задайте для них розумні цілі числа.
#Розрахуйте загальну вартість споживання електроенергії, використовуючи денні та нічні показання та тарифи, та збережіть результат у змінній payment.

rate = 1.68
value_day = 150
value_night = 100
payment = value_day * rate + value_night * rate / 2
print(f"Загальна вартість споживання електроенергії: {payment} гривень")   