#Створіть програму на Python, яка виконує серію операцій з двома списками, змінюючи їхній вміст і порядок елементів.

#Задачі:
#Маючи два списки my_list і some_data, використайте метод extend, щоб додати всі елементи зі списку some_data до кінця списку my_list.
#Використайте метод insert, щоб додати рядок 'Python' на позицію з індексом 1 у списку my_list.
#Використайте метод reverse, щоб розвернути порядок елементів у списку my_list.

#Очікуваний результат:
#Після виконання програми, список my_list повинен відображати вказані зміни.

my_list = [2024, 3.12]
some_data = ['Python']
my_list.extend(some_data)
print(my_list)  # Виведе: [2024, 3.12, 'Python']

my_list.insert(1, 'Python')

my_list.reverse()
print(my_list)

