#Приклад використання параметру *args

'''
Спочатку розглянемо приклад *args. Параметр *args використовується у визначенні функції для вказівки на те,
 що функція може приймати довільну кількість позиційних аргументів. 
Це означає, що ви можете передавати в функцію стільки аргументів, скільки потрібно,
 без необхідності їх попереднього визначення.
'''

def print_all_args(*args):
    for arg in args:
        print(arg)

print_all_args(1, 'hello', True, 3.14, [1, 2, 3], {'a': 1, 'b': 2})
#Виведення:
# 1
# hello
# True
# 3.14
# [1, 2, 3]
# {'a': 1, 'b': 2}


#У цьому прикладі, функція print_all_args може приймати будь-яку кількість аргументів.
# Аргументи 1, 'hello', True, 3.14, [1, 2, 3], {'a': 1, 'b': 2} передаються у функцію як кортеж 
# і в середині функції змінна args зберігає кортеж (1, 'hello', True, 3.14, [1, 2, 3], {'a': 1, 'b': 2}).

'''
Де це може знадобиться? Насправді багато де, але ми розглянемо дуже простий та зрозумілий приклад. 
Нам треба написати функцію, яка буде передану будь яку кількість рядків об'єднувати в один рядок та повертати його.
'''
def concatenate(*args) -> str:
    result = ""
    for arg in args:
        result += arg
    return result

print(concatenate("Hello", " ", "world", "!"))
#Виведення:
# Hello world!
'''
У цьому прикладі, функція concatenate може приймати будь-яку кількість рядкових аргументів, які потім конкатенуються в один рядок. 
Під час виклику функції, всі позиційні аргументи, передані після останнього визначеного аргументу,
будуть упаковані в кортеж під ім'ям, що йде після символу * і зазвичай це ім'я args, але може бути будь-яке інше ім'я
'''
#Наступний приклад теж працюватиме але загально прийнято називати цей параметр args:
def concatenate(*strings) -> str:
    result = ""
    for arg in strings:
        result += arg
    return result

print(concatenate("Hello", " ", "world", "!"))
#Виведення:
# Hello world!

'''
Ми замінили назву параметру args на strings і в нас все продовжує працювати.
Отже підіб'ємо короткий підсумок - параметр *args використовується у визначенні функції для вказівки на те, що функція може приймати довільну кількість позиційних аргументів.
Це означає, що ви можете передавати в функцію стільки аргументів, скільки потрібно, без необхідності їх попереднього визначення
'''


