#Приклад використання параметру **kwargs

'''
Параметр **kwargs використовується у визначенні функції для вказівки на те, що функція може приймати довільну кількість ключових аргументів.
Назва kwargs пішла від "keyword arguments" та дозволяє передавати в функцію іменовані аргументи у вигляді словника.
'''

'''
Під час виклику функції, всі ключові аргументи, передані після останнього визначеного аргументу, будуть упаковані в словник під ім'ям,
що йде після ** та зазвичай це kwargs, але, як і випадку args, може бути будь-яке інше ім'я.
'''

def greet(**kwargs):
    for key, value in kwargs.items():
        print(f"{key}: {value}")

greet(name="Alice", age=25, city="New York")

#Виведення:
# name: Alice
# age: 25
# city: New York

'''
У цьому прикладі, greet може приймати будь-яку кількість ключових аргументів, які потім обробляються і виводяться. 
В середині функції змінна kwargs зберігає словник, в нашому випадку це {'name': 'Alice', 'age': 25, 'city': 'New York'}.
'''

'''
Якщо виникає питання коли використовувати ці параметри, то параметр *args ми використовуємо коли хочемо дозволити передавати функції різну кількість позиційних аргументів. 
Параметр **kwargs — коли ми хочемо дозволити передавати функції різну кількість ключових аргументів.
'''
'''
Проте ніхто не забороняє параметри *args та **kwargs використовувати разом у функції,
що дозволяє їй приймати довільну кількість як позиційних, так і ключових аргументів. 
Це робить функцію надзвичайно гнучкою. Головне пам'ятати, що коли ви використовуєте обидва ці параметри разом, *args має йти перед **kwargs.
Тоді параметр *args збере всі позиційні аргументи в кортеж, а **kwargs збере всі ключові аргументи в словник.
'''

def example_function(*args, **kwargs):
    print("Позиційні аргументи:", args)
    print("Ключові аргументи:", kwargs)

example_function(1, 2, 3, name="Alice", age=25)
#Виведення:
# Позиційні аргументи: (1, 2, 3)   
# Ключові аргументи: {'name': 'Alice', 'age': 25}

'''
При виклику example_function аргументи 1, 2, 3 є позиційними, які параметр *args збере в кортеж (1, 2, 3).
Аргументи name="Alice" та age=25 є ключовими, які **kwargs збере в словник {'name': 'Alice', 'age': 25}
'''
#❗ Завжди використовуйте *args перед **kwargs у визначенні функції, оскільки це обов'язкове правило синтаксису Python.