# Модуль 4 | Робота з файлами та модульна система
# Тема: Створення шляхів (Creating paths)
# Розглянуто:
# -----------------------------------------------
'''
Створення шляхів за допомогою класу Path у модулі pathlib у Python є зручним способом маніпуляції файловими шляхами, який абстрагує від особливостей конкретної операційної системи.

Клас Path автоматично адаптується до особливостей шляхів у різних операційних системах. Наприклад, у Windows використовуються зворотні слеші (\), тоді як в Unix-подібних системах (Linux, macOS) - прямі слеші (/).

Сам приклад процесу створення шляху наступний:
'''
from pathlib import Path

# Для Unix/Linux
path_unix = Path("/usr/bin/python3")

# Для Windows
path_windows = Path("C:/Users/Username/Documents/file.txt")

'''
Об'єднання шляхів у pathlib - це процес, за допомогою якого можна створювати повні шляхи до файлів або директорій шляхом додавання різних частин шляху разом.

Для об'єднання шляхів використовується оператор /. Це інтуїтивний спосіб створення шляху, який абстрагується від різниці в синтаксисі шляхів між різними операційними системами.

Розглянемо приклад:
'''

from 