# Модуль 2 | Керування потоком та функції
# Тема: Enclosing
# Розглянуто:
# -----------------------------------------------

#Enclosing

'''
Охоплювана (Enclosing) область видимості виникає, коли функція визначена всередині іншої функції. 
Змінні в функції, що охоплює доступні у внутрішній (вкладеній) функції, але не навпаки. 
Це означає, що внутрішня функція може читати але не змінювати змінні, визначені в функції, що її охоплює.
'''

#Розглянемо наступний приклад:

def outer_func():
    enclosing_var = "Я змінна в функції, що охоплює"

    def inner_func():
        print("Всередині вкладеної функції:", enclosing_var)

    inner_func()

outer_func()

# Виведення:
# Всередині вкладеної функції: Я змінна в функції, що охоплює


'''Тут enclosing_var є змінною в функції outer_func, що охоплює функцію inner_func.
 Вона доступна для читання в вкладеній функції inner_func, 
 але не може бути змінена в inner_func без використання ключового слова nonlocal.'''

#Для того, щоб розібратися як змінювати змінні в функції, що охоплює внутрішню функцію, розглянемо приклад:

def func_outer():
    x = 2

    def func_inner():
        nonlocal x
        x = 5

    func_inner()
    return x

result = func_outer()  # 5

'''
Коли ми перебуваємо всередині функції func_inner, змінна x, визначена у першому рядку функції func_outer, знаходиться в enclosing області видимості для неї. 
Якщо ми захочемо використати саме цю змінну x, ми повинні оголосити її nonlocal x всередині функції func_inner. Це означає, що змінна x, 
яку вона буде змінювати, є не локальною для func_inner, а знаходиться на більш високому рівні — в нашому випадку, в func_outer. 
Тому, коли func_inner змінює x на 5, ця зміна відображається на x в func_outer.'''

'''
Тому результат result дорівнюватиме 5, а не 2, 
оскільки всередині функції func_outer ми зробили виклик func_inner(), яка змінила x з 2 на 5.'''