# Модуль 2 | Керування потоком та функції
# Тема: Global
# Розглянуто:
# -----------------------------------------------

#Global

'''
Для того, щоб змінити глобальну змінну всередині функції,
необхідно використовувати ключове слово global.
Це вказує Python, що змінна не є локальною, а належить до глобальної області видимості. 
Без застосування зарезервованого слова global неможливо присвоїти значення змінній, визначеній за межами функції.

'''

x = 50

def func():
    global x
    print('x дорівнює', x)  # x дорівнює 50
    x = 2
    print('Змінюємо глобальне значення x на', x)  # Змінюємо глобальне значення x на 2

func()
print('Значення x складає', x)# Значення x складає 2

#Виведення:
# x дорівнює 50
# Змінюємо глобальне значення x на 2
# Значення x складає 2

'''
Зарезервоване слово global використовується для того, щоб оголосити, що x – це глобальна змінна,
а значить, коли ми присвоюємо значення імені x всередині функції,
ця зміна відобразиться на значенні змінної x в основному блоку програми. 
Використовуючи одне зарезервоване слово global, можна оголосити відразу декілька змінних: global x, y, z.

Використовувати global варто з великою обережністю і не потрібно зловживати такою можливістю.
'''