#Local

'''
У Python кожна змінна, оголошена всередині функції, є локальною для цієї функції. 
Це означає, що локальні змінні існують лише в межах блоку коду, де вони були оголошені, і не доступні за його межами.
'''

x = 50

def func() -> None:
    x = 2
    print('Зміна локального x на', x)  # Зміна локального x на 2

func()
print('Глобальний x як і раніше', x)  # x як і раніше 50

'''
Змінна x, оголошена всередині функції func, є локальною.
Коли ми присвоюємо їй значення 2, це не впливає на глобальну змінну x, оголошену поза функцією.
Тому, після виклику func(), виведення залишає глобальне значення x (яке дорівнює 50) незмінним.

Останнім викликом функції print ми виводимо значення x, 
вказане в основному блоці, підтверджуючи таким чином, 
що воно не змінилося при локальному присвоюванні значення в раніше викликаній функції.

Виведення:
Зміна локального x на 2
Глобальний x як і раніше 50
'''
#my example

x = input('Введіть глобальне значення x: ')

def func() -> None:
    x = input('Введіть локальне значення x: ')
    print('Зміна локального x на', x)

func()
print('Глобальний x як і раніше', x)   